{
    "wiridAsmaulHusna": [
          {
            "id": "1.1",
            "arab": "Pendahuluan: \n\nعَنۡ أَبِيۡ هُرَيۡرَةَ: قَالَ رَسُوۡلُ اللّٰهِ صَلَّى اللّٰهُ عَلَيۡهِ وَسَلَّمَ: يَقُوۡلُ اللّٰهُ عَزَّ وَجَلَّ... فَإِنۡ ذَكَرَنِيۡ فِيۡ نَفۡسِهِ ذَكَرۡتُهُ فِيۡ نَفۡسِيۡ وَإِنۡ ذَكَرَنِيۡ فِيۡ مَـلَإٍ ذَكَرۡتُهُ فِيۡ مَـلَإٍ خَيۡرٌ مِنۡهُ",
            "terjemahan": "Dari Abi Hurairah r.a: Rasulullah SAW bersabda: Allah Azza wa Jalla berfirman .... maka apabila ia menyebut-Ku dalam dirinya  maka Aku akan menyebutnya dalam diri-Ku dan apabila ia menyebut-Ku dalam suatu kelompok maka Aku akan menyebutnya dalam suatu kelompok yang lebih baik darinya. (HR. Asy Syaikhoni dan At Tirmidzi)"
        },   {
            "id": "1.2",
            "arab": "Dzikir Bersama: \n\nعَنۡ أَنَسٍ عَنِ النَّبِيِّ صَلَّى اللّٰهُ عَلَيۡهِ وَسَلَّمَ قَالَ: إِذَا مَرَرۡتُمۡ بِرِيَاضِ الۡجَنَّةِ فَارۡتَعُوۡا قَالُوۡا: وَمَا رِيَاضُ الۡجَنَّةِ, قَالَ: حَلَقُ الذِّكۡرِ",
            "terjemahan": "Dari Anas r.a dari Nabi SAW. Beliau bersabda: apabila kalian melewati taman-taman surga maka dengarkanlah baik-baik, mereka bertanya: apakah taman-taman surga itu? Beliau menjawab: kelompok-kelompok dzikir. (HR. At Tirmidzi)"
        },   {
            "id": "1.3",
            "arab": "وَعَنۡ أَبِي هُرَيۡرَةَ رَضِيَ اللّٰهُ عَنۡهُ عَنِ النَّبِيِّ صَلَّى اللّٰهُ عَلَيۡهِ وَسَلَّمَ قَالَ: إِنَّ لِلّٰهِ مَلٰئِكَةً يَطُوۡفُوۡنَ فِى الطُّرُقِ يَلۡتَمِسُوۡنَ أَهۡلَ الذِّكۡرِ. فَإِذَا وَجَدُوۡا قَوۡمًا يَذۡكُرُوۡنَ اللّٰهَ تَنَادَوۡا هَلُمُّوا إِلَى حَاجَتِكُمۡ قَالَ فَيَحُفُّوۡنَهُمۡ بِأَجۡنِحَتِهِمۡ إِلَى سَمَآءِ الدُّنۡيَا قَالَ فَيَسۡأَلُهُمۡ رَبُّهُمۡ وَهُوَ أَعۡلَمُ بِهِمۡ مَا يَقُوۡلُ عِبَادِي قَالُوا يُسَبِّحُوۡنَكَ وَيُكَبِّرُوۡنَكَ وَيَحۡمَدُوۡنَكَ وَيُمَجِّدُوۡنَكَ قَالَ فَيَقُوۡلُ هَلۡ رَأَوۡنِيۡ فَيَقُوۡلُوۡنَ: لَا وَاللّٰهِ مَارَأَوۡكَ. قَالَ فَيَقُوۡلُ كَيۡفَ لَوۡ رَأَوۡنِيۡ قَالَ يَقُوۡلُوۡنَ لَوۡ رَأَوۡكَ كَانُوۡا أَشَدَّ لَكَ عِبَادَةً وَأَشَدَّ لَكَ تَمۡجِيۡدًا وَأَكۡثَرَ لَكَ تَسۡبِيۡحًا",
            "terjemahan": "'Dari Abu Hurairah R.A. dari Nabi SAW beliau bersabda: sesungguhnya Allah memiliki malaikat yang berkeliling pada jalan-jalan mencari ahli dzikir. Maka apabila mereka mendapati suatu kaum yang berdzikir kepada Allah mereka saling memanggil' datanglah untuk memenuhi hajat-hajat kalian, beliau bersabda: maka para malaikat menaungi mereka dengan sayap-sayap mereka dari langit dunia lalu Rasul berkata: Tuhan mereka bertanya kepada mereka (dan Dia yang lebih tahu terhadap apa yang hamba-hamba-Ku katakan)? Mereka (para malaikat) menjawab: mereka mensucikan-Mu, dan membesarkan nama-Mu dan memuji-Mu dan memuliakan-Mu. Rasulullah bersabda lalu Ia (Allah) berfirman “apakah mereka melihat-Ku? Lalu mereka menjawab “tidak, demi Allah mereka tidak melihat Engkau. Rasul bersabda lagi, Allah berfirman bagaimana kalau seandainya mereka melihat-Ku? Ia bersabda: mereka berkata: “seandainya mereka melihat-Mu, mereka akan menjadi orang yang paling banyak beribadah kepada-Mu dan mereka memuji-Mu dengan sangat dan paling banyak bertasbih kepada-Mu”. (HR. Asy Syaikhoni dan At Tirmidzi)"
        },   {
            "id": "1.4",
            "arab": "Dzikir Jahr Dan Dzikir Sirr: \n\nوَاذۡكُرۡ رَبَّكَ فِيۡ نَفۡسِكَ تَضَرُّعًا وَخِيۡفَةً وَدُوۡنَ الۡجَهۡرِ مِنَ الۡقَوۡلِ بِالۡغُدُوِّ وَالۡاٰصَالِ ",
            "terjemahan": "Dan sebutlah (nama) Tuhanmu dalam jiwamu dengan merendahkan diri dan rasa takut dan tanpa mengeraskan suara, di waktu pagi dan petang. (Qs.Al A’raf : 205)"
        }   ],
        
        "dzikirJamai" :[
            {
                "id": "1.1",
                "arab": "أَسۡتَغۡفِرُ اللّٰهَ (×3) ",
                "terjemahan": "Aku mohon ampun kepada Allah.” (3x) (HR. Muslim)"
            },   {
                "id": "1.2",
                "arab": "اَللّٰهُمَّ اَنۡتَ السَّلَامُ وَمِنۡكَ السَّلَامُ تَبَارَكۡتَ يَاذَا الۡجَلَالِ وَاۡلإِكۡرَامِ ",
                "terjemahan": "Wahai Allah,Engkau adalah keselamatan dan dari-Mu keselamatan, Maha Suci Engkau, wahai Dzat yang Memiliki keagungan dan kemuliaan. (HR. Muslim)"
            },   {
                "id": "1.3",
                "arab": "اَلۡحَمۡدُ لِلّٰهِ رَبِّ الۡعٰلَمِيۡنَ حَمۡدًا يُوَافِيۡ نِعَمَهُ وَيُكَافِيۡ مَزِيۡدَهُ. يَا رَبَّنَا لَكَ الۡحَمۡدُ كَمَا يَنۡبَغِيۡ لِجَلَالِ وَجۡهِكَ وَعَظِيۡمِ سُلۡطَانِكَ (رَوَاهُ ابۡنُ مَاجَه) اَللّٰهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى اٰلِ مُحَمَّـدٍ ",
                "terjemahan":  "Segala puji bagi Allah yang telah menyempurnakan nikmat dan karunia-Nya. Wahai Tuhan kami, bagi-Mu segala puji sesuai keagungan wajah-Mu dan kemegahan kerajaan-Mu. (HR. Ibnu Majah) Ya Allah, sampaikanlah shalawat atas Nabi Muhammad dan atas keluarga Nabi Muhammad. (HR. Ashhabussunan)"
            },   {
                "id": "1.4",
                "arab": "اَللّٰهُمَّ أَعِنِّي عَلَى ذِكۡرِكَ وَشُكۡرِكَ وَحُسۡنِ عِبَادَتِكَ ",
                "terjemahan": "Ya Allah, tolonglah aku untuk mengingat-Mu, bersyukur kepada-Mu dan memperbaiki ibadah kepada-Mu. (HR. Abu Dawud)"
            },
        {
            "id": "1.5",
            "arab": "لَا إِلٰهَ اِلَّا اللّٰهُ وَاللّٰهُ أَكۡبَرُ لَاحَوۡلَ وَلَا قُوَّةَ اِلَّا بِاللّٰهِ الۡعَلِيِّ الۡعظِيۡمِ ) (×3) (رَوَاهُ التِّرۡمِذِي)",
            "terjemahan": "Tiada Tuhan selain Allah dan Allah Maha Besar, tiada daya dan kekuatan kecuali dengan Allah Yang Maha Tinggi dan Maha Agung. (3X) (HR. At Tirmidzi)"
        },   {
            "id": "1.6",
            "arab": "إِنَّ اللّٰهَ وَمَلٰٓئِكَتَهُۥ يُصَلُّوۡنَ عَلَى النَّبِيِّ يٰٓأَيُّهَا الَّذِيۡنَ ءَامَنُوۡا صَلُّوۡا عَلَيۡهِ وَسَلِّمُوۡا تَسۡلِيۡمًا ",
            "terjemahan": "Sesungguhnya Allah dan para malaikat-Nya bershalawat kepada nabi, wahai orang-orang yang beriman bershalawat-lah  pada nabi dan bersalamlah kepadanya dengan sebenar-benar salam. (QS. Al Ahzab 56)"
        },   {
            "id": "1.7",
            "arab": "صَلَّى اللّٰهُ عَلَى النَّبِيِّ مُحَمَّدٍ (11 ×)",
            "terjemahan": "Allah bershalawat kepada Nabi Muhammad (11x)"
        },   {
            "id": "1.8",
            "arab": "حَسۡبِيَ اللّٰهُ لَا إِلٰهَ اِلَّا هُوَ عَلَيۡهِ تَوَكَّلۡتُ وَهُوَ رَبُّ الۡعَرۡشِ الۡعَظِيۡمِ (×7) ",
            "terjemahan": "Cukuplah bagiku Allah, tiada ilah kecuali Dia, kepada-Nya aku berserah diri dan Dia adalah penguasa Arsy yang mulia. (7x) (QS. At-Taubah 129)"
        },   {
            "id": "1.9",
            "arab": "يَا لَطِيۡفُ (3 ×) اَللّٰهُ لَطِيۡفُ (11 ×)",
            "terjemahan": "Wahai Dzat Yang Maha Lembut (3x) Allah Yang Maha Lembut. (11x)"
        },   {
            "id": "1.10",
            "arab": "يَا لَطِيۡفًا بِخَلۡقِهِ, يَا عَلِيۡمًا بِخَلۡقِهِ, يَاخَبِيۡرًا بِخَلۡقِهِ, اُلۡطُفۡ بِنَا يَالَطِيۡفُ, يَا عَلِيۡمُ, يَا خَبِيۡرُ (3×)",
            "terjemahan": "Wahai Dzat, Yang Maha Lembut terhadap ciptaan-Nya, Yang Maha Mengetahui terhadap ciptaan-Nya, Yang Maha Mengetahui terhadap ciptaan-Nya, lembutlah kepada kami wahai Dzat Yang Maha Lembut, Yang Maha Mengetahui, dan Yang Maha Mengetahui dengan teliti. (3X)"
        },   {
            "id": "1.11",
            "arab": "يَا لَطِيۡفًا لَمۡ يَزَلۡ اُلۡطُفۡ بِنَا فِيۡمَا نَزَلَ اِنَّكَ لَطِيۡفٌ لَمۡ تَزَلۡ اُلۡطُفۡ بِنَا وَالۡمُسۡلِمِيۡنَ (3 ×)",
            "terjemahan": "Wahai Dzat Yang Maha Lembut, yang tidak pernah sirna, lembutlah kepada kami terhadap apa-apa yang turun (musibah/cobaan), sesungguhnya Engkau Yang Maha Lembut yang tak pernah  sirna, lembutlah kepada kami dan kepada kaum muslimin. (3X)"
        },   {
            "id": "1.12",
            "arab": "لَآ إِلٰهَ إِلَّا اللّٰهُ الۡعَلِيُّ الۡعَظِيۡمُ لَآ إِلٰهَ إِلَّا اللّٰهُ الۡحَلِيۡمُ الۡكَرِيۡمُ لَآإِلٰهَ إِلَّا اللّٰهُ سُبۡحَانَ اللّٰهِ رَبِّ الۡعَرۡشِ الۡعَظِيۡمِ اَلۡحَمۡدُ لِلّٰهِ رَبِّ الۡعٰلَمِيۡنَ (×3)",
            "terjemahan": "Tiada Tuhan selain Allah Yang Maha Tinggi, Yang Maha Agung, tiada Tuhan kecuali Allah  Yang Maha penyantun dan  Maha Mulia, tiada Tuhan selain Allah, Maha Suci Allah Pemelihara Arsy yang Agung segala puji bagi Allah Tuhan semesta alam. (3 x)"
        },   {
            "id": "1.13",
            "arab": "اَللّٰهُمَّ اَلِّفۡ بَيۡنَ قُلُوۡبِنَا وَأَصۡلِحۡ ذَاتَ بَيۡنِنَا وَاهۡدِنَا سُبُلَ السَّلَامِ وَنَجِّنَا مِنَ الظُّلُمَاتِ إِلَى النُّوۡرِ وَجَنِّبۡنَا الۡفَوَاحِشَ مَا ظَهَرَ مِنۡهَا وَمَا بَطَنَ وَبَارِكۡ لَنَا فِيۡ أَسۡمَاعِنَا وَأَزۡوَاجِنَا وَذُرِّيَّاتِنَا وَتُبۡ عَلَيۡنَا إِنَّكَ اَنۡتَ التَّوَّابُ الرَّحِيۡمُ (رَوَاهُ الۡبُخَارِي)",
            "terjemahan": "Ya Allah, lembutkanlah hati diantara kami, dan perbaikilah urusan diantara kami, dan tunjukkanlah kami jalan keselamatan, dan selamatkanlah kami dari kesesatan kepada cahaya, dan jauhkanlah kami dari dosa-dosa yang nampak, maupun yang tersembunyi, dan berkahilah pada pendengaran kami, dan pasangan-pasangan kami, dan keturunan-keturunan kami, dan berilah ampun atas kami, sesungguhnya Engkau Maha Penerima Taubat dan Maha Penyayang. (HR. Bukhari)"
        },   {
            "id": "1.14",
            "arab": "اَللّٰهُمَّ حَبِّبۡ إِلَيۡنَا الۡإِيۡمَانَ وَزَيِّنۡهُ فِي قُلُوۡبِنَا وَكَرِّهۡ إِلَيۡنَا الۡكُفۡرَ وَالۡفُسُوۡقَ وَاۡلعِصۡيَانَ وَاجۡعَلۡنَا مِنَ الرَّاشِدِيۡنَ",
            "terjemahan": "Ya Allah, buatlah kami mencintai keimanan, dan hiaskanlah keimanan itu didalam hati kami, dan buatlah kami benci kepada kekafiran, kefasikan, dan kemaksiatan, dan jadikanlah kami termasuk orang-orang yang mendapat petunjuk. (HR. Ahmad)"
        },   {
            "id": "1.15",
            "arab": "اَللّٰهَمَّ يَا مُقَلِّبَ الۡقُلُوۡبِ، ثَـبِّتۡ قَلۡبِيۡ عَلَى دِيۡنِكَ (3 ×) ",
            "terjemahan": "Wahai Dzat yang membolak-balikkan hati, tetapkanlah hatiku atas agama-Mu. (3x) (HR. At Tirmidzi)"
        },   {
            "id": "1.16",
            "arab": "رَبَّنَا أَفۡرِغۡ عَلَيۡنَا صَبۡرًا وَثَبِّتۡ أَقۡدَامَنَا وَانۡصُرۡنَا عَلَى الۡقَوۡمِ الۡكٰفِرِيۡنَ ",
            "terjemahan": "Wahai Tuhan kami berikanlah kesabaran kepada kami, dan teguhkanlah langkah-langkah kami, dan tolonglah kami terhadap orang- orang kafir.(Al Baqarah: 250) "
        },   {
            "id": "1.17",
            "arab": "رَبَّنَا اغۡفِرۡ لَنَا وَلِإِخۡوَانِنَا الَّذِيۡنَ سَبَقُوۡنَا بِالۡإِيۡمَانِ وَلَا تَجۡعَلۡ فِي قُلُوۡبِنَا غِلًّا لِلَّذِيۡنَ ءَامَنُوۡا رَبَّنَا إِنَّكَ رَءُوۡفٌ رَحِيۡمٌ ",
            "terjemahan": "Ya Tuhan kami, ampunilah kami, dan saudara-saudara kami yang mendahului kami dalam iman, dan janganlah Engkau jadikan dalam hati-hati kami kedengkian kepada orang-orang yang beriman, sesungguhnya Engkau Maha Pengasih lagi Maha Penyanyang. (QS. Al Hasyr: 10) "
        },   {
            "id": "1.18",
            "arab": "يَا حَيُّ يَا قَيُّوۡمُ يَا بَدِيۡعَ السَّمٰوَاتِ وَالۡاَرۡضِ يَا ذَاالۡجَلَالِ وَالۡإِكۡرَامِ لَا إِلٰهَ اِلَّا اَنۡتَ بِرَحۡمَتِكَ نَسۡتَغِيۡثُ أَصۡلِحۡ لَنَا شَأۡنَنَا وَلَا تَكِلۡنَا إِلَى أَنۡفُسِنَا طَرۡفَةَ عَيۡنٍ ",
            "terjemahan": "Wahai Dzat Yang Maha Hidup dan Maha mengurusi, Dzat yang menghiasi langit dan bumi, Dzat yang memiliki keagungan dan kemuliaan. Tiada Tuhan selain Engkau, dengan rahmat-Mu kami mohon pertolongan, perbaikilah keadaan kami dan janganlah Engkau serahkan urusan kami kepada diri-diri kami sekejap matapun.(HR. Hakim) "
        },   {
            "id": "1.19",
            "arab": "اَللّٰهُمَّ اهۡدِ قَوۡمِيۡ فَاِنَّهُمۡ لَا يَعۡلَمُوۡنَ (7 ×)",
            "terjemahan": "Ya Allah, berilah petunjuk kaumku, sesungguhnya mereka kaum yang tidak mengetahui. (7 x)"
        },   {
            "id": "1.20",
            "arab": "رَبَّنَا أَخۡرِجۡنَا مِنۡ هٰذِهِ الۡقَرۡيَةِ الظَّالِمِ أَهۡلُهَا وَاجۡعَلۡ لَّنَا مِنۡ لَدُنۡكَ وَلِيًّا وَاجۡعَلۡ لَنَا مِنۡ لَدُنۡكَ نَصِيۡرًا (3×) (النِّسَاء: 75)",
            "terjemahan": "Ya Allah, keluarkanlah kami dari negeri yang dzolim penduduknya ini, dan berikanlah bagi kami dari sisi-Mu pemimpin, dan berikanlah kami dari sisi-Mu penolong.(3 x) (QS. An Nisaa': 75)"
        },   {
            "id": "1.21",
            "arab": "اَللّٰهُمَّ اهۡدِنَا فِيۡمَنۡ هَدَيۡتَ وَعَافِنَا فِيۡمَنۡ عَافَيۡتَ وَتَوَلَّنَا فِيۡمَنۡ تَولَّيۡتَ وَبَارِكۡ لَنَا فِيۡمَا أَعۡطَيۡتَ وَقِنَا شَرَّ مَا قَضَيۡتَ فَإِنَّكَ تَقۡضِيۡ وَلَا يُقۡضَى عَلَيۡكَ وَإنَّهُ لَايَذِلُّ مَنۡ وَالَيۡتَ وَلَا يَعِزُّ مَنۡ عَادَيۡتَ ",
            "terjemahan": "Ya Allah berikanlah kami petunjuk sebagaimana orang-orang yang telah Engkau beri hidayah, dan sehatkanlah kami sebagaimana orang-orang yang Engkau beri kesehatan, berikanlah kami kekuasaan sebagaimana orang-orang yang telah Engkau beri kekuasaan, dan berikanlah berkah di dalam apa saja yang Engkau telah berikan, jagalah kami dari keburukan taqdir-Mu, karena sesungguhnya Engkaulah yang menentukan, dan Engkau tidak ditentukan dan sesungguhnya tidak akan hina orang yang Engkau lindungi dan tidak akan mulia orang yang Engkau musuhi. (HR. Ashabussunan, Ahmad dan Ad Darimi)"
        },   {
            "id": "1.22",
            "arab": "اَللّٰهُمَّ إِنَّ هٰذَا إِقۡبَالُ لَيۡلِكَ وَإِدۡبَارُ نَهَارِكَ وَأَصۡوَاتُ دُعَاتِكَ فَاغۡفِرۡلَنَا. اَللّٰهُمَّ  إِنَّكَ تَعۡلَمُ أَنَّ هٰذِهِ الۡقُلُوۡبَ قَدِ اجۡتَمَعَتۡ عَلَى مَحَبَّتِكَ وَالۡتَقَتۡ عَلَى طَاعَتِكَ وَتَوَحَّدَتۡ عَلَى دَعۡوَتِكَ وَتَعَاهَدَتۡ عَلَى نُصۡرَةِ  شَرِيۡعَتِكَ فَوَثِّقِ اللّٰهُمَّ رَابِطَتَهَا وَأَدِّمۡ  وُدَّهَا وَاهۡدِهَا سُبُلَهَا وَامۡلَأۡهَا بِنُوۡرِكَ الَّذِيۡ لَايَخۡبُوۡ وَاشۡرَحۡ صُدُوۡرَنَا بِفَيۡضِ الۡإِيۡمَانِ بِكَ وَجَمِيۡلِ التَّوَكُّلِ عَلَيۡكَ وَأَحۡيِهَا بِمَعۡرِفَتِكَ وَأَمِتۡنَا عَلَى الشَّهَادَةِ فِيۡ سَبِيۡلِكَ إِنَّكَ نِعۡمَ الۡمَوۡلَى وَنِعۡمَ النَّصِيۡرِ ",
            "terjemahan": "Ya Allah, kini malam-Mu datang, dan siang-Mu hadir, dan inilah suara-suara dari pemanggil-Mu maka ampunilah kami, Ya Allah, sesungguhnya Engkau Maha Mengetahui bahwa hati-hati ini telah berkumpul karena mencintai-Mu dan bertemu untuk patuh kepada-Mu, telah bersatu untuk memikul beban dakwah-Mu, dan telah saling berjanji untuk menolong syariat-Mu, maka kuatkanlah ikatannya Ya Allah, dan kekalkanlah cintannya, dan tunjukkanlah jalan-jalan padanya, penuhilah ia dengan cahaya-Mu yang tidak pernah redup, lapangkanlah dada-dada  kami dengan kehidupan iman dan keindahan tawakkal kepada Mu, hidupkanlah ia dengan makrifat (ilmu pengetahuan yang benar) tentang Engkau, dan matikanlah kami sebagai syuhada dijalan-Mu. Engkaulah sebaik-baik pelindung dan penolong. (Doa Syaikh Imam Hasan Al Banna)"
        },   {
            "id": "1.23",
            "arab": "يَا رَحۡمٰنُ- يَا رَحِيۡمُ -يَا مَالِكُ –يَا قُدُّوۡسُ (×11) ",
            "terjemahan": "Wahai Dzat yang Maha Pengasih, Wahai Dzat yang Maha Penyayang, Wahai Dzat yang Maha Memiliki, Wahai Dzat yang Maha Suci."
        },   {
            "id": "1.24",
            "arab": "اَللّٰهُمَّ أَعِنَّا وَلَا تُعِنۡ عَلَيۡنَا, وَانۡصُرۡنَا وَلَا تَنۡصُرۡ عَلَيۡنَا وَامۡكُرۡ لَنَا وَلَا تَمۡكُرۡ عَلَيۡنَا وَاهۡدِنَا وَيَسِّرۡ هُدَانَا وَانۡصُرۡنَا عَلَى مَنۡ بَغَى عَلَيۡنَا, اَللّٰهُمَّ اجۡعَلۡنَا لَكَ شَاكِرِيۡنَ, لَكَ ذَاكِرِيۡنَ, لَكَ رَاهِبِيۡنَ, لَكَ مِطۡوَاعِيۡنَ, اِلَيۡكَ مُخۡبِتِيۡنَ, اَللّٰهُمَّ تَقَبَّلۡ تَوۡبَتَنَا وَاغۡسِلۡ حَوۡبَتَنَا وَأَجِبۡ دَعۡوَتَنَا وَثَبِّتۡ حُجَّتَنَا وَاهۡدِ قُلُوۡبَنَا وَسَدِّدۡ اَلۡسِنَتَنَا وَاسۡلُلۡ سَخِيۡمَةَ قُلُوۡبِنَا",
            "terjemahan": "Ya Allah, berilah kami pertolongan dan jangan beri pertolongan (kepada musuh) untuk mengalahkan kami. Berilah kami bantuan dan janganlah memberi bantuan untuk mengalahkan kami. Dan berilah kami jalan untuk dapat memberi tipu daya (kepada musuh) dan janganlah Engkau buat orang lain dapat memberi tipu daya kepada kami, berilah kami hidayah permudahlah hidayah kami, dan tolonglah kami terhadap orang yang berbuat aniaya kepada kami. Ya Allah, jadikanlah kami orang-orang yang bersyukur, orang-orang yang berdzikir,  orang-orang yang takut, orang-orang yang tunduk patuh, orang-orang yang khusyuk. Ya Allah, terimalah taubat kami, sucikanlah dosa kami, kabulkanlah permohonan kami, tegaskanlah hujjah (argumentasi) kami. Berilah hidayah kepada jiwa kami, fasihkanlah lisan-lisan kami, Dan keluarkanlah segala kotoran batin dari jiwa kami. (HR. Abu Dawud)"
        },   {
            "id": "1.25",
            "arab": "اَللّٰهُمَّ ارۡزُقۡ إِخۡوَانَنَا الۡغَائِبِيۡنَ عَنَّا الۡكَفَافَ وَالۡعَفَافَ وَالۡغِنَى وَالۡاِرۡتِيَاحَ وَالرِّضَا, اَللّٰهُمَّ جَمِّلۡهُمۡ بِالۡعَافِيَةِ وَالسَّلَامَةِ وَحَقِّقۡهُمۡ بِالتَّقۡوَى وَالۡاِسۡتِقَامَةِ وَأَعِذۡهُمۡ مِنۡ مُوۡجِبَاتِ النَّدَامَةِ, اَللّٰهُمَّ  يَسِّرۡ لَهُمۡ اُمُوۡرَهُمۡ فِيۡ الدَّعۡوَةِ بِحِفۡظِكَ وَأَمۡنِكَ وَأَمَانِكَ وَعِيَاذِكَ وَجِوَارِكَ, مِنۡ كُلِّ شَيۡطَانٍ مَرِيۡدٍ وَجَبَّارٍ عَنِيۡدٍ وَذِي عَيۡنٍ وَذِيۡ بَغۡيٍ وَذِيۡ سِحۡرٍ وَمِنۡ شَرِّ كُلِّ ذِيۡ شَرٍّ, إِنَّكَ عَلَى كُلِّ شَيۡءٍ قَدِيۡرٍ",
            "terjemahan": "Ya Allah, karuniakanlah kepada saudara-saudara kami yang ghaib (tidak hadir) berupa rizki yang cukup, kesucian diri, kecukupan, ketenangan, dan keridhoan. Ya Allah, baguskanlah mereka dengan kesehatan dan keselamatan. Kuatkanlah mereka dengan taqwa dan istiqomah. Peliharalah mereka dari  perkara-perkara yang mendatangkan penyesalan. Ya Allah, mudahkanlah bagi mereka urusan mereka di dalam dakwah dengan penjagaan-Mu, pengamanan-Mu, pertahanan-Mu, perlindungan dan pertolongan-Mu dari setan yang jahat, penguasa dzolim, dari kekuatan mata (termasuk spionase), dan dari kekejian, dari penyihir, dan dari kejahatan setiap orang yang berbuat kejahatan. Sesungguhnya Engkau Dzat Yang Maha Berkuasa atas segala sesuatu."
        },   {
            "id": "1.26",
            "arab": "اَللّٰهُمَّ ادۡفَعۡ عَنَّا الۡبَلَآءَ وَالۡوَبَآءَ وَالۡفَحۡشَآءَ وَالۡمُنۡكَرَ وَالۡمِحَنَ وَالۡفِتَنَ مَا ظَهَرَ مِنۡهَا وَمَا بَطَنَ مِنۡ بَلَدِنَا خَآصَّةً وَمِنۡ بُلۡدَانِ الۡمُسۡلِمِيۡنَ عَآمَّةً",
            "terjemahan": "Ya Allah, hindarkanlah kami dari bencana, wabah, kekejian, kemungkaran, cobaan-cobaan dan fitnah, yang nampak dan yang tidak nampak dari negri kami khususnya dan dari negri-negri orang muslim pada umumnya."
        },   {
            "id": "1.27",
            "arab": "اَللّٰهُمَّ لَا تُمَكِّنِ الۡاَعۡدَآءَ فِيۡنَا وَاجۡعَلۡ ثَأۡرَنَا عَلَى مَنۡ ظَلَمَنَا وَانۡصُرۡنَا عَلَى مَنۡ عَادَانَا ",
            "terjemahan": "Ya Allah, janganlah Engkau kuasakan musuh-musuh itu atas kami, dan jadikanlah pembalasan kami atas siapa saja yang menganiaya kami, dan menangkanlah kami atas siapa saja yang memusuhi kami. (HR.At Tirmidziy)"
        },   {
            "id": "1.28",
            "arab": "اَللّٰهُمَّ لَا تُسَلِّطۡ عَلَيۡنَا بِذُنُوۡبِنَا مَنۡ لَا يَخَافُكَ وَلَا يَرۡحَمُنَا",
            "terjemahan": "Ya Allah, disebabkan dosa-dosa kami, janganlah Engkau buat berkuasa atas kami orang-orang yang tak takut pada Engkau dan tak menyayangi kami. (HR. At Tirmidzi)"
        },   {
            "id": "1.29",
            "arab": "اَللّٰهُمَّ أَهۡلِكِ الۡكَفَرَةَ وَالۡمُبۡتَدِعَةَ وَالۡمُشۡرِكِيۡنَ أَعۡدَآءَكَ وَأَعۡدَآءَ الدِّيۡنِ",
            "terjemahan": "Ya Allah, hancurkanlah orang-orang kafir dan ahli bid’ah, serta orang-orang musyrik, mereka adalah musuh-Mu dan musuh agama."
        },   {
            "id": "1.30",
            "arab": "اَللّٰهُمَّ شَتِّتۡ شَمۡلَهُمۡ وَمَزِّقۡ جَمۡعَهُمۡ وَزَلۡزِلۡ أَقۡدَامَهُمۡ وَأَلۡقِ فِيۡ قُلُوۡبِهِمُ الرُّعۡبَ إِنَّكَ عَلَى كُلِّ شَيۡءٍ قَدِيۡرٌ",
            "terjemahan": "Ya Allah, pecahkanlah kesatuan mereka, dan retakkanlah kekompakan mereka, dan goncangkanlah pendirian mereka, dan letakkanlah dihati mereka rasa ketakutan. Sesungguhnya Engkau Maha Kuasa atas segala sesuatu"
        },   {
            "id": "1.31",
            "arab": "رَبِّ لَاتَذَرۡ عَلَى الۡاَرۡضِ مِنَ الۡكٰفِرِيۡنَ دَيَّارًا. إِنَّكَ إِنۡ تَذَرۡهُمۡ يُضِلُّوۡا عِبَادَكَ وَلَايَلِدُوۡآ اِلَّا فَاجِرًا كَفَّارًا ",
            "terjemahan": "Ya Tuhanku, janganlah Engkau tinggalkan di atas bumi seorangpun diantara orang-orang kafir itu. Sesungguhnya, jika Engkau tinggalkan mereka, niscaya mereka akan menyesatkan hamba-hamba-Mu, dan mereka tiada akan melahirkan anak, kecuali (anak) yang durhaka lagi kafir. (QS. Nuh: 26-27)"
        },   {
            "id": "1.32",
            "arab": "رَبِّ اَدۡخِلۡنِيۡ مُدۡخَلَ صِدۡقٍ وَاَخۡرِجۡنِي مُخۡرَجَ صِدۡقٍ وَاجۡعَلۡ لِي مِنۡ لَدُنۡكَ سُلۡطَانًا نَصِيۡرًا ",
            "terjemahan": "Ya Tuhan kami, masukkanlah kami melalui tempat masuk yang baik/benar, dan keluarkanlah kami melalui tempat keluar yang baik/benar, dan jadikanlah bagi kami kekuasaan dari sisi-Mu yang dapat menolong. (Al Isra’ : 80)"
        },   {
            "id": "1.33",
            "arab": "رَبَّنَا اٰتِنَا فِي الدُّنۡيَا حَسَنَةً وَفِي الۡاٰخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ ",
            "terjemahan": "Wahai Tuhan kami, berikanlah kepada kami kebaikan di dunia dan di akhirat dan hindarkanlah kami dari azab neraka. (QS. Al Baqarah 201)"
        },   {
            "id": "1.34",
            "arab": "رَبَّنَا تَقَبَّلۡ مِنَّا إِنَّكَ أَنۡتَ السَّمِيۡعُ الۡعَلِيۡمُ  ",
            "terjemahan": "Ya Tuhan kami, terimalah do'a permohonan (dari) kami, karena Engkaulah Yang Maha Mendengar lagi Maha Mengetahui. (QS: Al Baqarah: 127)"
        },   {
            "id": "1.35",
            "arab": "DIBACA OLEH SATU ORANG PEMIMPIN: \n\nاَللّٰهُمَّ ارۡزُقۡنَا تَوۡفِيۡقَ الطَّاعَةِ وَبُعۡدَ الۡمَعۡصِيَّةِ وَصِدۡقَ النِّيَّةِ وَعِرۡفَانَ الۡحُرۡمَةِ وَاَكۡرِمۡنَا بِالۡهُدَى وَالۡاِسۡتِقَامَةِ وَسَدِّدۡ أَلۡسِنَتَنَا بِالصَّوَابِ وَالۡحِكۡمَةِ وَامۡلَأۡ قُلُوۡبَنَا بِالۡعِلۡمِ وَالۡمَعۡرِفَةِ وَطَهِّرۡ بُطُوۡنَنَا مِنَ الۡحَرَامِ وَالشُّبۡهَةِ وَاكۡفُفۡ اَيۡدِيَنَا عَنِ الظُّلۡمِ وَالسَّرِقَةِ وَاغۡضُضۡ اَبۡصَارَنَا عَنِ الۡفُجُوۡرِ وَالۡخِيَانَةِ وَسُدَّ أَسۡمَاعَنَا عَنِ اللَّغۡوِ وَالۡغِيۡبَةِ وَتَفَضَّلۡ عَلَى عُلَمَآئِنَا بِالزُّهۡدِ وَالنَّصِيۡحَةِ, وَعَلَى الۡمُتَعَلِّمِيۡنَ بِالۡجُهۡدِ وَالرَّغۡبَةِ وَعَلَى الۡمُسۡتَمِعِيۡنَ بِالۡاِتِّبَاعِ وَالۡمَوۡعِظَةِ وَعَلَى مَرۡضَى الۡمُسۡلِمِيۡنَ بِالشِّفَآءِ وَالرَّاحَةِ وَعَلَى مَوۡتَاهُمۡ بِالرَّأۡفَةِ وَالرَّحۡمَةِ وَعَلَى مَشَايِخِنَا بِالۡوَقَارِ وَالسَّكِيۡنَةِ وَعَلَى الشَّبَابِ بِالۡاِنَابَةِ وَالتَّوۡبَةِ وَعَلَى النِّسَآءِ بِالۡحَيَآءِ وَالۡعِفَّةِ وَعَلَى الۡاَغۡنِيَآءِ بِالتَّوَاضُعِ وَالسَّعَةِ وَعَلَى الۡفُقَرَآءِ بِالصَّبۡرِ وَالۡقَنَاعَةِ وَعَلَى الۡغُزَاةِ بِالنَّصۡرِ وَالۡغَلَبَةِ وَعَلَى الۡأُسَرَآءِ بِالۡخَلَاصِ وَالرَّاحَةِ وَعَلَى الۡاُمَرَآءِ بِالۡعَدۡلِ وَالشَّفَقَةِ عَلَى الرَّعِيَّةِ بِالۡاِنۡصَافِ وَحُسۡنِ السِّيۡرَةِ وَبَارِكۡ لِلۡحُجَّاجِ وَالزُّوَارِ فِي الزَّادِ وَالنَّفَقَةِ وَاقۡضِ مَا أَوۡجَبۡتَ عَلَيۡهِمۡ مِنَ الۡحَجِّ وَالۡعُمۡرَةِ  بِفَضۡلِكَ وَرَحۡمَتِكَ يَا أَرۡحَمَ الرَّاحِمِيۡنَ ",
            "terjemahan": "Ya Allah, karuniakan pada kami kemudahan untuk taat menjauhi maksiat, meluruskan niat dan mengetahui kemuliaan, muliakan kami dengan hidayah dan istiqamah, luruskan lidah kami dengan kebenaran dan hikmah, penuhi hati dengan ilmu dan makrifat, bersihkan perut kami dari haram dan subhat, tahan tangan kami dari kezhaliman dan perampasan, tundukkan pandangan kami dari kemaksiatan dan pengkhianatan. Palingkan pendengaran kami dari ucapan yang sia-sia dan umpatan, karuniakan pada ulama kami kezuhudan dan nasihat, pada para pelajar kesungguhan dan semangat, pada para pendengar kepatuhan dan peringatan, pada kaum muslimin yang sakit kesembuhan dan ketenangan, pada kaum muslimin yang meninggal kasih sayang Allah dan rahmat, pada orang-orang tua kami kehormatan dan ketentraman, pada para pemuda penyesalan dan taubat, pada para wanita rasa malu dan kesucian, pada orang-orang kaya rendah hati dan kemurahhatian, pada orang-orang miskin kesabaran dan kecukupan, pada para pejuang kemenangan dan penaklukan, pada para tawanan kebebasan dan ketenangan, pada para pemimpin keadilan dan rasa sayang, pada seluruh rakyat kejujuran dan kebaikan akhlak. Berkahilah para jemaah haji dan para penzirah dalam bekal dan nafkah, sempurnakanlah haji dan umrah yang Engkau tetapkan bagi mereka dengan karunia dan rahmat-Mu, wahai Yang Paling Pengasih dari semua yang mengasihi"
        },   {
            "id": "1.36",
            "arab": "سُبۡحٰنَ رَبِّكَ رَبِّ الۡعِزَّةِ عَمَّا يَصِفُوۡنَ. وَسَلَامٌ عَلَى الۡمُرۡسَلِيۡنَ. وَالۡحَمۡدُ لِلّٰهِ رَبِّ الۡعٰلَمِيۡنَ  ",
            "terjemahan": "Maha Suci Tuhanmu Tuhan yang Maha Tinggi, dari apa-apa yang mereka sifatkan dan keselamatan atas para Rasul, dan segala puji bagi Allah, Tuhan semesta alam. (QS. Ash-Shaffat: 180-182)"
        }
    ]
}