{
    "doaMajelis":[
        {
            "id": "1.1",
            "arab": "أَعُوۡذُ بِاللّٰهِ مِنَ الشَّيۡطَانِ الرَّجِيۡمِ. بسۡمِ اللّٰهِ الرَّحۡمٰنِ الرَّحِيۡمِ",
            "terjemahan": "Aku berlindung kepada Allah dari godaan syetan yang terkutuk. Dengan nama Allah yang Maha Pengasih lagi Maha Penyayang"
        },   {
            "id": "1.2",
            "arab": "اَلۡحَمۡدُ لِلّٰهِ رَبِّ الۡعَالَمِيۡنَ حَمۡدًا يُوَافِيۡ نِعَمَهُ وَيُكَافِيۡ مَزِيۡدَهُ. يَا رَبَّنَا لَكَ الۡحَمۡدُ كَمَا يَنۡبَغِيۡ لِجَلَالِ وَجۡهِكَ وَعَظِيۡمِ سُلۡطَانِكَ (رَوَاهُ ابن مَاجَه)",
            "terjemahan": "Segala puji bagi Allah yang telah menyempurnakan nikmat dan karunia-Nya. Wahai Tuhan kami, bagi-Mu segala puji sesuai keagungan wajah-Mu dan kemegahan kerajaan-Mu. (HR. Ibnu Majah)"
        },   {
            "id": "1.3",
            "arab": "اَللّٰهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى اٰلِ مُحَمَّـدٍ",
            "terjemahan": "Ya Allah, sampaikanlah shalawat atas Nabi Muhammad dan atas keluarga Nabi Muhammad. (HR. Ashhabussunan)"
        },   {
            "id": "1.4",
            "arab": "رَبَّنَا ظَلَمۡنَا أَنۡفُسَنَا وَإِنۡ لَّمۡ تَغۡفِرۡ لَنَا وَتَرۡحَمۡنَا لَنَكُوۡنَنَّ مِنَ الۡخٰسِرِيۡنَ ",
            "terjemahan": "Wahai Tuhan kami, kami telah mendzolimi diri-diri kami jika Engkau tidak mengampuni kami dan merahmati kami pasti kami termasuk orang-orang yang merugi. (Al A'raf : 23)"
        },   {
            "id": "1.5",
            "arab": "اَللّٰهُمَّ أَرِنَا الۡحَقَّ حَقًّا وَارۡزُقۡنَا اتِّبَاعَهُ وَأَرِنَا الۡبَاطِلَ بَاطِلًا وَارۡزُقۡنَا اجۡتِنَابَهُ (رَوَاهُ الۡبُخَارِي)",
            "terjemahan": "Ya Allah, tunjukkanlah kami yang benar itu benar dan berikanlah kepada kami kemampuan untuk mengikutinya dan tunjukkanlah kami bahwa yang batil itu batil dan berikanlah kami kemampuan untuk menjauhinya. (HR. Bukhari)"
        },   {
            "id": "1.6",
            "arab": "اَللّٰهُمَّ اَلِّفۡ بَيۡنَ قُلُوۡبِنَا وَأَصۡلِحۡ ذَاتَ بَيۡنِنَا وَاهۡدِنَا سُبُلَ السَّلَامِ وَنَجِّنَا مِنَ الظُّلُمَاتِ إِلَى النُّوۡرِ وَجنِّبۡنَا الۡفَوَاحِشَ مَا ظَهَرَ مِنۡهَا وَمَا بَطَنَ وَبَارِكۡ لَنَا فِيۡ أَسۡمَاعِنَا وَأَزۡوَاجِنَا وَذُرِّيَاتنَا وَتُبۡ عَلَيۡنَا إِنَّكَ اَنۡتَ التَّوَّابُ الرَّحِيۡمُ ",
            "terjemahan": "Ya Allah, lembutkanlah hati diantara kami, dan perbaikilah urusan diantara kami, dan tunjukkanlah kami jalan keselamatan, dan selamatkanlah kami dari kesesatan kepada cahaya, dan jauhkanlah kami dari dosa-dosa yang nampak, maupun yang tersembunyi, dan berkahilah pada pendengaran kami, dan pasangan-pasangan kami, dan keturunan-keturunan kami, dan berilah ampun atas kami, sesungguhnya Engkau Maha Penerima Taubat dan Maha Penyayang. (HR. Bukhari)"
        },   {
            "id": "1.7",
            "arab": "رَبَّنَا اغۡفِرۡ لَنَا وَلِإِخۡوَانِنَا الَّذِيۡنَ سَبَقُوۡنَا بِالۡإِيۡمَانِ وَلَا تَجۡعَلۡنَا فِيۡ قُلُوۡبِنَا غِلًّا لِّلَّذِيۡنَ ءَامَنُوۡا رَبَّنَا إِنَّكَ رَءُوۡفٌ رَحِيۡمٌ ",
            "terjemahan": "Ya Tuhan kami, ampunilah kami dan saudara-saudara kami yang telah mendahului kami dalam keimanan, dan janganlah Engkau jadikan di dalam hati-hati kami kedengkian terhadap orang-orang yang beriman, Ya Tuhan kami, sesungguhnya Engkau Maha Lembut lagi Maha penyayang. (QS. Al Hasyr: 10)"
        },   {
            "id": "1.8",
            "arab": "رَبَّنَا اغۡفِرۡ لَنَا ذُنُوۡبَنَا وَإِسۡرَافَنَا فِيۡ أَمۡرِنَا وَثَبِّتۡ أَقۡدَامَنَا وَانۡصُرۡنَا عَلَى الۡقَوۡمِ الۡكٰفِرِيۡنَ (ال عِمۡرَانَ:147)",
            "terjemahan": "Ya Tuhan kami, ampunilah dosa-dosa kami dan keberlebih-lebihan kami dalam urusan kami dan tetapkanlah langkah-langkah kami dan tolonglah kami atas kaum yang kafir.(Ali Imran: 147)"
        },   {
            "id": "1.9",
            "arab": "اَللّٰهُمَّ إِنَّا نَسۡأَلُكَ سَلَامَةً فِي الدِّيۡنِ وَعَافِيَةً فِيۡ الۡجَسَدِ وَزِيَادَةً فِي الۡعِلۡمِ وَبَرَكَةً فِي الرِّزۡقِ وَتَوۡبَةً قَبۡلَ الۡمَوۡتِ وَرَحۡمَةً عِنۡدَ الۡمَوۡتِ وَمَغۡفِرَةً بَعۡدَ الۡمَوۡتِ. اَللّٰهُمَّ هَوِّنۡ عَلَيۡنَا فِيۡ سَكَرَاتِ الۡمَوۡتِ وَالنَّجَاةَ مِنَ النَّارِ وَالۡعَفۡوَ عِنۡدَ الۡحِسَابِ",
            "terjemahan": "Ya Allah, kami mohon kepadamu keselamatan dalam agama, kesehatan dalam jasmani, tambahan dalam ilmu, keberkahan dalam rizki dan dapat  bertaubat sebelum mati, dan mendapat rahmat ketika mati dan ampunan setelah mati. Ya Allah, mudahkanlah atas kami dalam sakarotul maut dan keselamatan dari neraka dan mendapatkan kemaafan pada hari perhitungan."
        },   {
            "id": "1.10",
            "arab": "رَبَّنَا لَاتُؤَاخِذۡنَا إِنۡ نَسِيۡنَا أَوۡ أَخۡطَأۡنَا رَبَّنَا وَلَاتَحۡمِلۡ عَلَيۡنَا إِصۡرًا كَمَا حَمَلۡتَهُ عَلَى الَّذِيۡنَ مِنۡ قَبۡلِنَا رَبَّنَا وَلَا تُحَمِّلۡنَا مَا لَا طَاقَةَ لَنَا بِهِۦ  وَاعۡفُ عَنَّا وَاغۡفِرۡ لَنَا وَارۡحَمۡنَا أَنۡتَ مَوۡلٰـنَا فَانۡصُرۡنَا عَلَى  الۡقَوۡمِ الۡكٰفِرِيۡنَ ",
            "terjemahan": "Wahai Tuhan Kami, janganlah Engkau mengazab kami jika kami lupa atau kami bersalah. Wahai Tuhan kami, janganlah Engkau bebankan kepada kami beban yang berat sebagaimana Engkau bebankan atas orang-orang yang sebelum kami, Wahai Tuhan kami, janganlah Engkau pikulkan kami apa-apa yang tak sanggup kami memikulnya, dan maafkanlah kami dan ampunilah kami dan rahmatilah kami, Engkaulah pelindung kami dan tolonglah kami atas kaum yang kafir. (Qs. Al Baqarah: 286)"
        },
        {
            "id": "1.11",
            "arab": "رَبَّنَا لَا تُزِغۡ قُلُوۡبَنَا بَعۡدَ إِذۡ هَدَيۡتَنَا وَهَبۡ لَنَا مِنۡ لَدُنۡكَ رَحۡمَةً إِنَّكَ أَنۡتَ الۡوَهَّابُ ",
            "terjemahan": "Ya Tuhan kami, janganlah Engkau palingkan hati-hati kami setelah Engkau memberi petunjuk kepada kami, dan berilah kami rahmat, sesungguhnya Engkaulah maha Pemberi. (QS. Ali Imran: 8)"
        },   {
            "id": "1.12",
            "arab": "اَللّٰهُمَّ ادۡفَعۡ عَنَّا الۡبَلَآءَ وَالۡوَبَآءَ وَالۡفَحۡشَآءَ وَالۡمُنۡكَرَ وَالۡمِحَنَ وَالۡفِتَنَ مَا ظَهَرَ مِنۡهَا وَمَا بَطَنَ مِنۡ بَلَدِنَا خَآصَّةً وَمِنۡ بُلۡدَانِ الۡمُسۡلِمِيۡنَ عَآمَّةً",
            "terjemahan": "Ya Allah, hindarkanlah kami dari bencana, wabah, kekejian, kemungkaran, cobaan-cobaan dan fitnah, yang nampak dan yang tidak nampak dari negri kami khususnya dan dari negri-negri orang muslim pada umumnya."
        },   {
            "id": "1.13",
            "arab": "رَبِّ اجۡعَلۡ هٰذَا بَلَدًا ءَامِنًا وَّارۡزُقۡ أَهۡلَهُ مِنَ الثَّمَرٰتِ مَنۡ ءَامَنَ مِنۡهُمۡ بِاللّٰهِ وَالۡيَوۡمِ الۡاٰخِرِ. رَبَّنَا تَقَبَّلۡ مِنَّا إِنَّكَ أَنۡتَ السَّمِيۡعُ الۡعَلِيۡمُ (البقرة:126-127)",
            "terjemahan": "Ya Tuhanku, jadikanlah negri ini, negri yang aman sentosa dan berikanlah rizki dari buah-buahan kepada penduduknya yang beriman kepada Allah dan hari kiamat diantara mereka. Ya Tuhan kami, terimalah do'a-do'a kami, sesungguhnya Engkau Maha Mendengar  lagi  Maha Mengetahui. (QS. Al-Baqarah 126-127)"
        },   {
            "id": "1.14",
            "arab": "رَبَّنَا ءَاتِنَا فِي الدُّنۡيَا حَسَنَةً وَفِي الۡاٰخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ (البقرة 201)",
            "terjemahan": "Wahai Tuhan kami, berikanlah kepada kami kebaikan di dunia dan di akhirat dan hindarkanlah kami dari azab neraka. (QS. Al Baqarah 201)"
        },   {
            "id": "1.15",
            "arab": "رَبَّنَا تَقَبَّلۡ مِنَّا إنَّكَ أَنۡتَ السَّمِيۡعُ الۡعَلِيۡمُ ",
            "terjemahan": "Ya Tuhan kami, terimalah do'a permohonan (dari) kami, karena Engkaulah Yang Maha Mendengar lagi Maha Mengetahui. (QS Al Baqarah: 127 )"
        },   {
            "id": "1.16",
            "arab": "سُبۡحٰنَ رَبِّكَ رَبِّ الۡعِزَّةِ عَمَّا يَصِفُوۡنَ.  وَسَلَامٌ عَلَى الۡمُرۡسَلِيۡنَ. وَالۡحَمۡدُ لِلّٰهِ رَبِّ الۡعٰلَميۡنَ (الصَّآفَّات:180-182)",
            "terjemahan": "Maha Suci Tuhanmu, Yang Maha Tinggi dari apa-apa yang mereka sifatkan dan keselamatan atas para Rasul, dan segala puji bagi Allah, Tuhan semesta alam. (QS. Ash-Shaffat: 180-182)"
        }
    ],
    "wiridAnak" : [
        {
            "id": "1.1",
            "arab": " (×3) أَسۡتَغۡفِرُ اللّٰهَ ",
            "terjemahan": "Aku mohon ampun kepada  Allah.” (3x)(HR. Muslim)"
        },   {
            "id": "1.2",
            "arab": "اَللّٰهُمَّ اَنۡتَ السَّلَامُ وَمِنۡكَ السَّلَامُ تَبَارَكۡتَ يَاذَا الۡجَلَالِ وَالۡإِكۡرَامِ ",
            "terjemahan": "Wahai Allah, Engkau adalah keselamatan dan dari-Mu keselamatan, Maha Suci Engkau, wahai Dzat yang Memiliki keagungan dan kemuliaan. (HR. Muslim)"
        },   {
            "id": "1.3",
            "arab": "اَللّٰهُمَّ أَعِنِّي عَلَى ذِكۡرِكَ وَشُكۡرِكَ وَحُسۡنِ عِبَادَتِكَ ",
            "terjemahan": "Ya Allah, tolonglah aku untuk mengingat-Mu, bersyukur kepada-Mu dan memperbaiki ibadah kepada-Mu. (HR. Abu Dawud)"
        },   {
            "id": "1.4",
            "arab": "أَسۡتَغۡفِرُ اللّٰهَ (×11) سُبۡحَانَ اللّٰهِ (11×) اَلۡحَمۡدُ لِلّٰهِ (11×) اَللّٰهُ اَكۡبَرُ (11 ×)",
            "terjemahan": "Aku mohon ampun kepada Allah (11x) Mahasuci Allah (11x) Segala Puji bagi Allah (11x) Allah Maha Besar (11x)"
        },   {
            "id": "1.5",
            "arab": "اَلۡحَمۡدُ لِلّٰهِ رَبِّ الۡعَالَمِيۡنَ حَمۡدًا يُوَافِيۡ نِعَمَهُ وَيُكَافِيۡ مَزِيۡدَهُ. يَا رَبَّنَا لَكَ الۡحَمۡدُ كَمَا يَنۡبَغِيۡ لِجَلَالِ وَجۡهِكَ وَعَظِيۡمِ سُلۡطَانِكَ",
            "terjemahan": "Segala puji bagi Allah yang telah menyempurnakan nikmat dan karunia-Nya. Wahai Tuhan kami, bagi-Mu segala puji sesuai keagungan wajah-Mu dan kemegahan kerajaan-Mu. (HR. Ibnu Majah) "
        },   {
            "id": "1.6",
            "arab": "اَللّٰهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى اٰلِ مُحَمَّـدٍ ",
            "terjemahan": "Ya Allah, sampaikanlah shalawat atas Nabi Muhammad dan atas keluarga Nabi Muhammad. (HR. Ashhabussunan)"
        },   {
            "id": "1.7",
            "arab": "يَا عَلِيۡمُ - يَا حَلِيۡمُ - يَا عَلِيُّ - يَا عَظِيۡمُ",
            "terjemahan": "Wahai Yang Maha Mengetahui, Wahai Yang Maha Penyantun, Wahai Yang Maha Tinggi, Wahai Yang Maha Agung."
        },   {
            "id": "1.8",
            "arab": "رَبِّ اغۡفِرۡ لِيۡ وَلِوَالِدَيَّ وَارۡحَمۡهُمَا كَمَا رَبَّيَانِيۡ صَغِيۡرًا",
            "terjemahan": "Wahai Tuhanku, Ampunilah aku dan kedua orang tuaku dan kasihilah mereka sebagaimana mereka mengasihiku di waktu kecil."
        },   {
            "id": "1.9",
            "arab": "رَبِّ اجۡعَلۡنِيۡ مُقِيۡمَ الصَّلَاةِ وَمِنۡ ذُرِّيَّتِيۡ. رَبَّنَا وَتَقَبَّلۡ دُعَآءِ. رَبَّنَا اغۡفِرۡ لِيۡ وَلِوَالِدَيَّ وَلِلۡمُؤۡمِنِيۡنَ يَوۡمَ يَقُوۡمُ الۡحِسَابِ (ابراهيم 40-41)",
            "terjemahan": "Ya Rabb, jadikanlah aku orang yang me-negakkan sholat dan dari keturunanku juga, Ya Tuhan kami, terimalah do'a-do'a kami. Ya Tuhan kami,  ampuni-lah aku dan kedua orang tuaku dan orang-orang mukmin pada hari perhitungan ditegakkan. (QS. Ibrahim: 40-41)"
        },   {
            "id": "1.10",
            "arab": "رَبِّ اشۡرَحۡ لِيۡ صَدۡرِيۡ وَيَسِّرۡلِيۡ أَمۡرِيۡ وَاحۡلُلۡ عُقۡدَةً مِّنۡ لِّسَانِيۡ يَفۡقَهُوۡا قَوۡلِيۡ (طه: 25-28)",
            "terjemahan": "Ya Tuhanku, lapangkanlah dadaku dan mudahkanlah urusanku dan lepaskanlah kekakuan dari lidahku supaya mereka mengerti perkataanku. (Qs. Thoha: 25-28)"
        },   {
            "id": "1.11",
            "arab": "رَبِّ زِدۡنِيۡ عِلۡمًا وَارۡزُقۡنِيۡ فَهۡمًا وَاجۡعَلۡنِيۡ مِنۡ عِبَادِكَ الصَّالِحِيۡنَ ",
            "terjemahan": "Wahai Tuhanku, tambahlah ilmuku dan anugerahkan aku kefahaman dan jadikanlah aku hamba-hamba-Mu yang sholeh."
        },   {
            "id": "1.12",
            "arab": "رَبِّ أَوۡزِعۡنِيۡ أَنۡ أَشۡكُرَ نِعۡمَتَكَ الَّتِيۡ أَنۡعَمۡتَ عَلَيَّ وَعَلَى وَالِدَيَّ وَأَنۡ أَعۡمَلَ صَالِحًا تَرۡضَاهُ وَأَدۡخِلۡنِيۡ بِرَحۡمَتِكَ فِيۡ عِبَادِكَ الصّٰلِحِيۡنَ (النمل:19)            ",
            "terjemahan": "Ya Tuhanku, bantulah aku untuk mensyukuri nikmat-Mu yang telah Engkau berikan kepadaku dan kepada kedua orang tuaku dan bantulah aku melaksanakan amal  sholeh yang Engkau ridhoi dan masukanlah aku dengan rahmat-Mu ke dalam hamba-hamba-Mu yang sholeh. (Qs. An Naml: 19)"
        },   {
            "id": "1.13",
            "arab": "اَللّٰهُمَّ أَرِنَا الۡحَقَّ حَقًّا وَارۡزُقۡنَا اتِّبَاعَهُ وَأَرِنَا الۡبَاطِلَ بَاطِلًا وَارۡزُقۡنَا اجۡتِنَابَهُ (رَوَاهُ الۡبُخَارِي)",
            "terjemahan": "Ya Allah, tunjukkanlah kami bahwa yang benar adalah benar dan anugerahilah kepada kami untuk bisa mengikutinya, dan tunjukkanlah kami bahwa yang salah adalah salah, dan anugerahilah kami untuk bisa menjauhinya. (HR. Bukhari)"
        },   {
            "id": "1.14",
            "arab": "رَبَّنَا ءَاتِنَا فِي الدُّنۡيَا حَسَنَةً وَّفِي الۡاٰخِرَةِ حَسَنَةً وَّقِنَا عَذَابَ النَّارِ (البقرة 201)",
            "terjemahan": "Wahai Tuhan kami, berikanlah kepada kami kebaikan di dunia dan di akhirat dan hindarkanlah kami dari azab neraka. (QS. Al Baqarah 201)"
        },   {
            "id": "1.15",
            "arab": "سُبۡحٰنَ رَبِّكَ رَبِّ الۡعِزَّةِ عَمَّا يَصِفُوۡنَ.  وَسَلَامٌ عَلَى الۡمُرۡسَلِيۡنَ. وَالۡحَمۡدُ لِلّٰهِ رَبِّ الۡعٰلَميۡنَ (الصافات: 180-182)",
            "terjemahan": "Maha Suci Tuhanmu Yang Maha Tinggi dari apa-apa yang mereka sifatkan dan keselamatan atas para Rasul, dan segala puji bagi Allah, Tuhan semesta alam. (Qs. Ash-Shaffat: 180-182)"
        }
    ],
    "melawanSyaitan" : [
        {
            "id": null,
            "arab": "DO’A MELAWAN SYAITHAN",
            "terjemahan": null
        },
        {
            "id": "1.1",
            "arab": "أَعُوۡذُ بِاللّٰهِ مِنَ الشَّيۡطٰنِ الرَّجِيۡمِ ",
            "terjemahan": "Aku berlindung kepada Allah dari godaan setan yang terkutuk."
        },   {
            "id": "1.2",
            "arab": "بسۡمِ اللّٰهِ الرَّحۡمٰنِ الرَّحِيۡمِ  الٓـّمٓ  ١ ذٰلِكَ  الۡكِتَابُ لَارَيۡبَ ۛفِيهِۛ هُدًى لِّلۡمُتَّقِيۡنَ ٢ الَّذِيۡنَ  يُؤۡمِنُوۡنَ بِالۡغَيۡبِ وَيُقِيۡمُوۡنَ الصَّلٰوةَ وَمِمَّا رَزَقۡنَا هُمۡ  يُنۡفِقُوۡنَ ٣ وَالَّذِيۡنَ  يُؤۡمِنُوۡنَ بِمَآ أُنۡزِلَ إِلَيۡكَ وَمَآ أُنۡزِلَ مِنۡ قَبۡلِكَ وَبِالۡاٰخِرَةِ هُمۡ يُوۡقِنُوۡنَ ٤ أُولٰٓئِكَ عَلَى هُدًى مِّنۡ رَّبِّهِمۡ وَأُولٰٓئِكَ هُمُ الۡمُفۡلِحُوۡنَ ",
            "terjemahan": "Alif laam miim. (1) Kitab ini (Al Quran) sama sekali tidak ada keraguan di dalamnya, petunjuk bagi orang-orang yang bertaqwa (2) Yaitu orang-orang yang beriman kepada yang ghaib, dan mereka menegakkan shalat, dan dari apa-apa yang kami rizkikan kepada mereka, mereka menginfakkannya (3) Dan orang-orang yang  mereka beriman kepada  apa-apa yang diturunkan kepadamu (Al Quran) dan kepada apa-apa yang  diturunkan sebelum engkau, dan terhadap negri akhirat mereka yakin (4) Mereka Itulah berada diatas petunjuk Tuhan mereka, dan mereka itulah orang-orang yang beruntung (QS. Al Baqarah 1-5)"
        },   {
            "id": "1.3",
            "arab": "اَللّٰهُ لَآ إِلٰهَ اِلَّا هُوَ الۡحَيُّ الۡقَيُّوۡمُج لَا تَأۡخُذُهُۥ سِنَةٌ وَّلَا نَوۡمٌط لَهُۥ مَا فِي السَّمٰوَاتِ وَمَا فِي  الۡاَرۡضِط مَنۡ ذَا الَّذِيۡ يَشۡفَعُ عِنۡدَهُۥ اِلَّا بِإِذۡنِهِۦط يَعۡلَمُ مَا بَيۡنَ أَيۡدِيۡهِمۡ وَمَا خَلۡفَهُمۡج وَلَا يُحِيۡطُوۡنَ بِشَيۡءٍ مِنۡ عِلۡمِهِۦ اِلَّا بِمَا شَآءَج وَسِعَ كُرۡسِيُّهُ السَّمٰوَاتِ  وَالۡاَرۡضَج وَلَا يَئُوۡدُهُۥ حِفۡظُهُمَا وَهُوَ الۡعَلِيُّ الۡعَظِيۡمُ (٢٥٥)  لَآإِكۡرَاهَ فِي الدِّيۡنِلا قَدۡ تَّبَيَّنَ الرُّشۡدُ مِنَ الۡغَيِّج فَمَنۡ يَّكۡفُرۡ بِالطَّاغُوۡتِ وَيُؤۡمِنۡ بِاللّٰهِ فَقَدِ اسۡتَمۡسَكَ بِالۡعُرۡوَةِ الۡوُثۡقَىج لَاانۡفِصَامَ لَهَا وَاللّٰهُ سَمِيۡعٌ عَلِيۡمٌ٢٥٦ اَللّٰهُ وَلِيُّ الَّذِيۡنَ ءَامَنُوۡا  يُخۡرِجُهُمۡ مِنَ الظُّلُمَاتِ إِلَى النُّوۡرِط وَالَّذِيۡنَ كَفَرُوۡا أَوۡلِيٰآئُهُمُ الطَّاغُوۡتُلا يُخۡرِجُوۡنَهُمۡ مِنَ النُّوۡرِ إِلَى الظُّلُمَاتِط أُولٰٓئِكَ أَصۡحَابُ النَّارِ هُمۡ فِيۡهَا خَالِدُوۡنَاَللّٰهُ لَآ إِلٰهَ اِلَّا هُوَ الۡحَيُّ الۡقَيُّوۡمُج لَا تَأۡخُذُهُۥ سِنَةٌ وَّلَا نَوۡمٌط لَهُۥ مَا فِي السَّمٰوَاتِ وَمَا فِي  الۡاَرۡضِط مَنۡ ذَا الَّذِيۡ يَشۡفَعُ عِنۡدَهُۥ اِلَّا بِإِذۡنِهِۦط يَعۡلَمُ مَا بَيۡنَ أَيۡدِيۡهِمۡ وَمَا خَلۡفَهُمۡج وَلَا يُحِيۡطُوۡنَ بِشَيۡءٍ مِنۡ عِلۡمِهِۦ اِلَّا بِمَا شَآءَج وَسِعَ كُرۡسِيُّهُ السَّمٰوَاتِ  وَالۡاَرۡضَج وَلَا يَئُوۡدُهُۥ حِفۡظُهُمَا وَهُوَ الۡعَلِيُّ الۡعَظِيۡمُ (٢٥٥)  لَآإِكۡرَاهَ فِي الدِّيۡنِلا قَدۡ تَّبَيَّنَ الرُّشۡدُ مِنَ الۡغَيِّج فَمَنۡ يَّكۡفُرۡ بِالطَّاغُوۡتِ وَيُؤۡمِنۡ بِاللّٰهِ فَقَدِ اسۡتَمۡسَكَ بِالۡعُرۡوَةِ الۡوُثۡقَىج لَاانۡفِصَامَ لَهَا وَاللّٰهُ سَمِيۡعٌ عَلِيۡمٌ٢٥٦ اَللّٰهُ وَلِيُّ الَّذِيۡنَ ءَامَنُوۡا  يُخۡرِجُهُمۡ مِنَ الظُّلُمَاتِ إِلَى النُّوۡرِط وَالَّذِيۡنَ كَفَرُوۡا أَوۡلِيٰآئُهُمُ الطَّاغُوۡتُلا يُخۡرِجُوۡنَهُمۡ مِنَ النُّوۡرِ إِلَى الظُّلُمَاتِط أُولٰٓئِكَ أَصۡحَابُ النَّارِ هُمۡ فِيۡهَا خَالِدُوۡنَ",
            "terjemahan": "Allah, tidak ada Tuhan selain Dia, Yang Maha Hidup lagi terus menerus mengurus makhluk-Nya, Tidak menimpanya kantuk dan tidak pula tidur, Kepunyaan-Nya apa-apa yang di langit dan apa-apa yang di bumi, Tidak ada yang dapat memberi syafaat di sisi –Nya (Allah) kecuali dengan izin-Nya. Dia mengetahui apa-apa yang ada di hadapan mereka dan di belakang mereka, Dan mereka tidak mengetahui sesuatupun dari ilmu Allah kecuali apa- apa yang Allah kehendaki, Luas singgasana-Nya meliputi langit dan bumi. Dan Allah tidak berat memelihara keduanya dan Dia Maha Tinggi lagi Maha Agung (255) Sama sekali tidak ada paksaan dalam agama (Islam); sungguh petunjuk itu telah jelas dari kesesatan. Maka barang siapa yang kafir  kepada thogut dan beriman kepada Allah, Maka sungguh ia telah berpegang kepada tali yang amat kuat, yang sama sekali tidak akan terputus baginya, Dan Allah Maha Mendengar lagi Maha Mengetahui (256) Allah adalah Pelindung orang-orang yang beriman, Dia  mengeluarkan mereka dari kegelapan kepada cahaya, dan orang-orang yang kafir, pemimpin-pemimpin mereka adalah thogut, thoghut  itu  mengeluarkan mereka dari cahaya kepada kegelapan, mereka itulah penghuni-penghuni neraka; mereka kekal di dalamnya. (QS. Al Baqarah 255-257)"
        },   {
            "id": "1.4",
            "arab": "لِلّٰهِ مَافِي السَّمٰوَاتِ وَمَا فِي الۡاَرۡضِط وَإِنۡ تُبۡدُوۡا مَا فِيۡ أَنۡفُسِكُمۡ أَوۡ تُخۡفُوۡهُ  يُحَاسِبۡكُمۡ بِهِ اللّٰهُط فَيَغۡفِرُ لِمَنۡ يَّشَآءُ وَيُعَذِّبُ مَنۡ يَّشَآءُط وَاللّٰهُ عَلٰى كُلِّ شَيۡءٍ قَدِيۡرٌ ٢٨٤  ءَامَنَ الرَّسُوۡلُ بِمَآ أُنۡزِلَ إِلَيۡهِ مِنۡ رَبِّهِۦ وَالۡمُؤۡمِنُوۡنَط كُلٌّ ءَامَنَ بِاللّٰهِ وَمَلٰٓئِكَتِهِۦ وَكُتُبِهِۦ وَرُسُلِهِۦلا لَانُفَرِّقُ بَيۡنَ أَحَدٍ مِنۡ رُسُلِهِۦلا وَقَالُوۡا سَمِعۡنَا وَأَطَعۡنَا غُفۡرَانَكَ رَبَّنَا وَإِلَيۡكَ الۡمَصِيۡرُ٢٨٥ لَايُكَلِّفُ اللّٰهُ نَفۡسًا اِلَّاوُسۡعَهَاط لَهَا مَاكَسَبَتۡ وَعَلَيۡهَا مَااكۡتَسَبَتۡط رَبَّنَا لَا تُؤَاخِذۡنَآ إِنۡ نَسِيۡنَآ أَوۡ أَخۡطَأۡنَاج رَبَّنَا وَلَا تَحۡمِلۡ عَلَيۡنَا إِصۡرًا كَمَا حَمَلۡتَهُۥ عَلَى الَّذِيۡنَ مِنۡ قَبۡلِنَاج رَبَّنَا وَلَا تُحَمِّلۡنَا مَا لَا طَاقَةَ لَنَا بِهِۦج وَاعۡفُ عَنَّاج وَاغۡفِرۡ لَنَاط وَارۡحَمۡنَاط أَنۡتَ مَوۡلٰنَا فَانۡصُرۡنَا عَلَى الۡقَوۡمِ الۡكٰفِرِيۡنَج ",
            "terjemahan": "Milik Allahlah apa-apa yang ada di langit dan apa-apa yang ada di bumi.  Dan jika kalian menampakkan apa yang ada dalam diri kalian, atau kalian menyembunyikannya, maka Allah akan menghisab kalian dengannya,  Lalu Dia mengampuni orang-orang yang Ia kehendaki dan mengazab orang-orang yang Ia kehandaki, Dan Allah atas segala sesuatu Maha Berkuasa. (284)  Rasul telah beriman kepada apa-apa yang diturunkan kepadanya dari Tuhannya dan demikian pula orang-orang yang beriman.  Semuanya beriman kepada Allah, dan malaikat-malaikat-Nya, kitab-kitab-Nya dan rasul-rasul-Nya. Kami tidak membeda-bedakan seorangpun dari rasul-rasul-Nya.  Dan mereka mengatakan: 'Kami dengar dan Kami taat, Ampunan-Mu, wahai Tuhan Kami, dan kepada-Mulah tempat kembali'. (285) Allah tidak membebani seseorang kecuali sesuai dengan kemampuannya, baginya balasan atas apa-apa (kebaikan) yang telah ia kerjakan dan atasnya (siksaan) bagi apa-apa  (keburukan) yang telah ia kerjakan,  Wahai Tuhan Kami, janganlah Engkau siksa kami jika kami lupa atau kami bersalah,  Wahai Tuhan kami, janganlah Engkau bebankan kepada kami beban yang berat, sebagaimana telah Engkau bebankan  kepada orang-orang yang sebelum kami. Wahai Tuhan kami, janganlah Engkau membebankan kepada kami apa-apa yang sama sekali  tidak ada kemampuan atas kami. Ma'afkanlah kami; ampunilah kami; dan rahmatilah kami. Engkaulah penolong kami, maka tolonglah kami terhadap kaum yang kafir. (QS.Al Baqarah 284 –286)"
        },   {
            "id": "1.5",
            "arab": "Setiap selesai sholat subuh: \n\nلَا إِلٰهَ اِلَّا اللّٰهُ وَحۡدَهُ لَا شَرِيۡكَ لَهُ، لَهُ الۡمُلۡكُ وَلَهُ الۡحَمۡدُ يُحۡيِيۡ وَيُمِيۡتُ وَهُوَ عَلَى كُلِّ شۡئٍ قَدِيۡرٌ (100×) ",
            "terjemahan": "Tiada Tuhan selain Allah Yang Esa, tidak ada sekutu bagi-Nya, bagi-Nya  kerajaan dan pujian, Dia menghidupkan dan mematikan dan Dia atas segala sesuatu Maha berkuasa. (HR. Asy Syaikhoni dan At Tirmizi)"
        },   {
            "id": "1.6",
            "arab": "Membaca surat Al Baqarah lengkap (HR. Muslim)",
            "terjemahan": null
        },   {
            "id": "1.7",
            "arab": "Mengingat Allah SWT (HR. Tirmidzi)",
            "terjemahan": null
        },   {
            "id": "1.8",
            "arab": "Berwudhu tatkala marah (HR. Abu Dawud)",
            "terjemahan": null
        },   {
            "id": "1.9",
            "arab": "Berwudhu sebelum tidur, membaca ayat kursi dan dzikir kepada Allah sampai rasa kantuk menjemput sebagaimana hadist dari Abu Hurairah. ",
            "terjemahan": null
        },   {
            "id": "1.10",
            "arab": "Setiap pagi dan sore membaca: \n\nبِسۡمِ اللّٰهِ الَّذِيۡ لَا يَضُرُّ مَعَ اسۡمِهِ شَيۡئٌ فِي الۡاَرۡضِ وَلَا فِي السَّمَآءِ وَهُوَ السَّمِيۡعُ الۡعَلِيۡمُ (3×) ",
            "terjemahan": "Dengan nama Allah yang tidak mudharat sesuatu beserta-Nya baik di bumi maupun di langit dan Dia Maha Mendengar lagi Maha Mengetahui. (HR. Tirmizi)"
        }, {
            "id": "1.11",
            "arab": "Setelah sholat Subuh dan Magrib: \n\nأَعُوۡذُ بِكَلِمَاتِ اللّٰهِ التَّآمَّاتِ لَا يُجَاوِزُهُنَّ بَرٌّ وَلَا فَاجِرٌ مِنۡ شَرِّ مَاخَلَقَ وَذَرَأَ وَبَرَأَ وَمِنۡ شَرِّ مَا يَنۡزِلُ مِنَ السَّمَآءِ وَمِنۡ شَرِّ مَا يَعۡرُجُ مِنۡهَا وَمِنۡ شَرِّ مَا ذَرَأَ فِي الۡاَرۡضِ وَمِنۡ شَرِّ مَايَخۡرُجُ مِنۡهَا وَمِنۡ شَرِّ فِتَنِ الَّيۡلِ وَالنَّهَارِ وَمِنۡ شَرِّ طَوَارِقِ الَّيۡلِ وَالنَّهَارِ اِلَّا طَارِقًا يَّطۡرُقُ بِخَيۡرٍ يَا رَحۡمٰنُ ",
            "terjemahan": "Aku berlindung dengan ayat-ayat Allah yang sempurna, yang tiada dapat diungguli oleh orang yang berbakti dan orang yang durhaka dari segala bentuk kejahatan yang telah diciptakan-Nya, dari segala kejahatan yang turun dari langit dan yang naik ke langit; dari segala kejahatan yang diciptakan-Nya di bumi dan  yang keluar dari padanya (bumi); dari keburukan fitnah (ujian) di malam dan siang hari, dan dari keburukan bencana yang datang  di waktu malam dan siang hari; kecuali cobaan yang datang membawa kebaikan, wahai Dzat  yang Maha Penyayang. (HR. Ahmad)"
        },   {
            "id": "1.12",
            "arab": "Setiap pagi dan sore membaca: \n\nأَعُوۡذُ بِكَلِمَاتِ اللّٰهِ التَّآمَّاتِ مِنۡ غَضَبِهِ وَمِنۡ شَرِّ عِبَادِهِ وَمِنۡ شَرِّ هَمَزَاتِ الشَّيَاطِيۡنَ وَأَنۡ يَحۡضُرُوۡنِ ",
            "terjemahan": "Aku berlindung dengan ayat-ayat Allah yang sempurna, dari murka-Nya, siksa-Nya, kejahatan hamba-hamba-Nya dan dari godaan  (bisikan) syaithan,  serta kedatangan syaitan kepadaku. (HR. Abu Dawud)"
        },   {
            "id": "1.13",
            "arab": "Setiap pagi dan sore membaca: \n\nاَللّٰهُمَّ إِنِّى أَعُوۡذُ بِوَجۡهِكَ الۡكَرِيۡمِ وَكَلِمَاتِكَ التَّآمَّاتِ مِنۡ شَرِّ مَا أَنۡتَ اٰخِذٌ بِنَاصِيَتِهِ اَللّٰهُمَّ أَنۡتَ تَكۡشِفُ الۡمَأۡثَمَ وَالۡمَغۡرَمَ اَللّٰهُمَّ إِنَّهُ لَايُهۡزَمُ جُنۡدُكَ وَلَا يُخۡلَفُ وَعۡدُكَ سُبۡحَانَكَ وَبِحَمۡدِكَ ",
            "terjemahan": "Ya Allah, Aku berlindung kepada-Mu yang Maha Mulia dan ayat-ayat-Mu yang sempurna dari keburukan apa-apa yang Engkau pegang ubun-ubunnya, Ya Allah Engkaulah yang menghapuskan dosa dan kerugian. Ya Allah, sesungguhnya pasukan (tentara)-Mu takkan dapat dikalahkan, dan janji-Mu takkan diingkari, Maha Suci Engkau dan maha terpujilah Engkau."
        },   {
            "id": "1.14",
            "arab": "Setiap pagi dan sore membaca: \n\nأَعُوۡذُ بِوَجۡهِ الۡعَظِيۡمِ الَّذِيۡ لَا شَيۡئَ أَعۡظَمَ مِنۡهُ وَبِكَلِمَاتِ اللّٰهِ الَّتِيۡ لَايُجَاوِزُهُنَّ بَرٌّ وَلَافَاجِرٌ وَبِأَسۡمَآءِ اللّٰهِ الۡحُسۡنَى كُلِّهَا مَاعَلِمۡتُ مِنۡهَا وَمَالَمۡ أَعۡلَمُ مِنۡ شَرِّ مَاخَلَقَ وَذَرَأَ وَبَرَأَ وَمِنۡ شَرِّ كُلِّ ذِيۡ شَرٍّ لَا أَطِيۡقُ شَرَّهُ وَمِنۡ شَرِّ كُلِّ ذِيۡ شَرٍّ أَنۡتَ اٰخِذٌ بِنَاصِيَتِهَا إِنَّ رَبِّيۡ عَلَى صِرَاطٍ مُسۡتَقِيۡمٍ",
            "terjemahan": "Aku berlindung dengan wajah Allah Yang Maha Agung, yang tiada sesuatupun melebihi keagungan-Nya, dan aku berlindung dengan ayat-ayat-Nya yang sempurna, ayat-ayat yang tiada dapat diungguli oleh orang yang berbakti dan orang yang durhaka, dan aku berlindung dengan semua nama-nama Allah yang indah, baik yang aku ketahui maupun yang tidak aku ketahui dari keburukan apa-apa yang telah ia ciptakan, dari apa-apa yang ia kembang biakkan dan dari apa-apa yang ia ciptakan sejak awal, dan dari setiap keburukan yang mengandung keburukan, Dan setiap keburukan yang aku tidak menguasainya, dan dari setiap keburukan yang Engkau memegang ubun-ubunnya (kendali), sesungguhnya Tuhanku di atas jalan yang lurus (selalu berbuat adil)."
        },  {
            "id": "1.15",
            "arab": "Setiap pagi dan sore membaca: \n\nتَحَصَّنۡتُ بِاللّٰهِ الَّذِيۡ لَا إِلٰهَ اِلَّا هُوَ إِلٰهِيۡ وَإِلٰهُ كُلِّ شَيۡئٍ وَاعۡتَصَمۡتُ بِرَبِّيۡ وَرَبِّ كُلِّ شَيۡئٍ وَتَوَكَّلۡتُ عَلَى الۡحَيِّ الَّذِيۡ لَايَمُوۡتُ وَاسۡتَدۡفَعۡتُ الشَّرَّ بِلَا حَوۡلَ وَلَا قُوَّةَ اِلَّا بِاللّٰهِ حَسۡبِيَ اللّٰهُ وَنِعۡمَ الۡوَكِيۡلِ حَسۡبِيَ الرَّبُّ مِنَ الۡعِبَادِ حَسۡبِيَ الۡخَالِقُ مِنَ الۡمَخۡلُوۡقِ حَسۡبِيَ الرَّازِقُ مِنَ الۡمَرۡزُوۡقِ حَسۡبِيَ الَّذِيۡ بِيَدِهِ مَلَكُوۡتُ كُلِّ شَيۡئٍ وَهُوَ يُجِيۡرُ وَلَايُجَارُ عَلَيۡهِ حَسۡبِيَ اللّٰهُ لَاإِلٰهَ اِلَّا هُوَ عَلَيۡهِ تَوَكَّلۡتُ وَهُوَ رَبُّ الۡعَرۡشِ الۡعَظِيۡمِ",
            "terjemahan": "Aku membentengi diriku dengan Allah, Dzat yang tiada Tuhan selain Dia, Tuhanku dan Tuhan segala sesuatu. Aku berpegang teguh kepada Tuhanku dan Tuhan segala sesuatu. Aku serahkan diriku kepada (Dzat) yang hidup (kekal) yang tiada mati. Aku menolak kejahatan dengan ucapan. Tiada daya dan kekuatan, melainkan atas pertolongan Allah. Cukuplah Allah jadi pelindung bagiku dan  (Dia adalah) sebaik-baik pelindung. Cukuplah Tuhan Yang Maha  Pemelihara jadi pelindung bagiku dari seluruh hamba-Nya. Cukuplah  Tuhan yang  maha Pencipta jadi pelindung bagiku dari semua ciptaan-Nya. Cukuplah Tuhan yang Maha Pemberi Rezeki dari semua yang diberi rezeki (oleh-Nya). Cukuplah bagiku Dzat yang ditangan-Nya berada kekuasaan atas segala sesuatu, sedang Dia melindungi, dan tidak ada yang dapat dilindungi dari (adzab)-Nya. Cukuplah Allah bagiku; tiada ada Tuhan selain Dia. Kepada-Nya aku berserah diri (bertawakkal), dan Dia adalah Tuhan yang memiliki ‘Arsy yang agung."
        }
    ],
"wiridQiyamul": [  {
    "id": "1.1",
    "arab": "Do'a Dan Wirid Sebelum Sholat: \n\nاَللّٰهُ اَكۡبَرُ (10 ×) اَلۡحَمۡدُ لِلّٰهِ (10×) سُبۡحَانَ اللّٰهِ وَبِحَمۡدِهِ (10×) سُبۡحَانَ الۡمَلِكِ الۡقُدُّوۡسِ (10×) أَسۡتَغۡفِرُ اللّٰهَ (10×) لَا إِلٰهَ اِلَّا اللّٰهُ (10×)  ",
    "terjemahan": "Allah Maha Besar (10 x) Segala puji bagi Allah (10 x) Maha Suci Allah dan segala pujiannya (10x) Maha Suci Raja yang Maha suci (10X) Aku Minta ampun (10 x) Tiada ilah selain Allah (10 x). (HR. Abu Dawud)"
},   {
    "id": "1.2",
    "arab": "اَللّٰهُمَّ إِنِّيۡ أَعُوۡذُ بِكَ مِنۡ ضِيۡقِ الدُّنۡيَا وَضِيۡقِ يَوۡمِ الۡقِيَامَةِ (10×)",
    "terjemahan": "Ya Allah, Sungguh Aku berlindung kepada-Mu dari sempitnya dunia dan sempitnya pada hari kiamat.(HR. Abu Dawud)"
},   {
    "id": "1.3",
    "arab": "Munajat Qiyamul Lail: \n\nحَسۡبِيَ اللّٰهُ لَا إِلٰهَ اِلَّا هُوَ عَلَيۡهِ تَوَكَّلۡتُ وَهُوَ رَبُّ الۡعَرۡشِ الۡعَظِيۡمِ (×7) ",
    "terjemahan": "Cukuplah bagiku Allah, tiada ilah kecuali Dia, kepada-Nya aku berserah diri dan Dia adalah penguasa Arsy yang mulia. (7x) (QS. At-Taubah 129)"
},   {
    "id": "1.4",
    "arab": "يَا لَطِيۡفُ (3 ×)  اَللّٰهُ  لَطِيۡفُ (11 ×)",
    "terjemahan": "Wahai Dzat Yang Maha Lembut (3x) Allah Yang Maha Lembut. (11x)"
},   {
    "id": "1.5",
    "arab": "رَبِّ اشۡرَحۡ لِيۡ صَدۡرِيۡ وَيَسِّرۡ لِيۡ أَمۡرِيۡ وَاحۡلُلۡ عُقۡدَ ةً مِّنۡ لِّسَانِيۡ يَفۡقَهُوۡا قَوۡلِيۡ (3×) ",
    "terjemahan": "Ya Tuhanku, lapangkanlah dadaku dan mudahkanlah urusanku dan lepaskanlah kekakuan dari lidahku supaya mereka mengerti perkataanku. (3x) (Qs. Thoha: 25-28)"
},   {
    "id": "1.6",
    "arab": "رَبَّنَا افۡتَحۡ بَيۡنَنَا وَبَيۡنَ قَوۡمِنَا بِالۡحَقِّ وَأَنۡتَ خَيۡرُ الۡفَاتِحِيۡنَ (7×)",
    "terjemahan": "Wahai Tuhan kami, bukalah diantara kami dan diantara kaum kami kebenaran dan engkaulah sebaik-baik pemberi kemenangan. (7x)"
},   {
    "id": "1.7",
    "arab": "اَللّٰهُمَّ اهۡدِ قَوۡمِيۡ فَإِنَّهُمۡ لَا يَعۡلَمُوۡن (7×)",
    "terjemahan": "Ya Allah, berilah hidayah kepada kaumku, sesungguhnya mereka tidak mengetahui. (7x)"
},   {
    "id": "1.8",
    "arab": "رَبَّنَآ أَخۡرِجۡنَا مِنۡ هٰذِهِ الۡقَرۡيَةِ الظَّالِمِ أَهۡلُهَا وَاجۡعَلۡ لَّنَا مِنۡ لَّدُنۡكَ وَلِيًّا وَّاجۡعَلۡ لَّنَا مِنۡ لَّدُنۡكَ نَصِيۡرًا (3×) ",
    "terjemahan": "wahai Tuhan kami, keluarkanlah kami dari negri yang dzolim penduduknya ini, dan jadikanlah bagi kami dari sisi-Mu pelindung dan jadikanlah bagi kami dari sisi-Mu penolong. (3x) (QS. An Nisa’ :75)"
},   {
    "id": "1.9",
    "arab": "Do'a Setelah Sholat Witir: \n\nسُبۡحٰنَ الۡمَلِكِ الۡقُدُّوۡسِ (3×) ",
    "terjemahan": "Maha suci Raja Yang Maha suci. ( 3x) (HR. An Nasa'i)"
},   {
    "id": "1.10",
    "arab": "سُبُّوحٌ قُدُّوۡسُ رَبُّنَا وَرَبُّ الۡمَلٰٓئِكَةِ وَالرُّوۡحِ ",
    "terjemahan": "Maha suci dan Maha suci Tuhan Kami dan Tuhan Para malaikat dan Malaikat Jibril (ruh). (HR. AN Nasa'i)"
}, {
    "id": "1.11",
    "arab": "اللّٰهُمَّ إِنِّيۡ أَعُوۡذُ بِرِضَاكَ مِنۡ سَخَطِكَ وَبِمُعَافَاتِكَ مِنۡ عُقُوۡبَتِكَ وَأَعُوۡذُ بِكَ مِنۡكَ لَا أُحۡصِيۡ ثَنَاءً عَلَيۡكَ أَنۡتَ كَمَا أَثۡنَيۡتَ عَلَى نَفۡسِكَ",
    "terjemahan": "Ya Allah, sesungguhnya Aku berlindung dengan keridhoan-Mu dari murka-Mu, dan dengan kemaafan-Mu dari siksa-Mu, dan aku berlindung kepada-Mu dari siksa-Mu.  Aku tidak mampu menghitung pujian atas-Mu, Engkau sebagaimana Engkau memuji atas diri-Mu sendiri. (HR. Muslim)"
}, {
    "id": "1.12",
    "arab": "Persiapan Sholat Malam: \n\nإِنَّ فِيۡ خَلۡقِ السَّمَٰوَٰتِ وَالۡأَرۡضِ وَاخۡتِلَٰفِ الَّيۡلِ وَالنَّهَارِ لَأٓيَٰتٖ لِّأُوْلِي الۡأَلۡبَٰبِ(190) الَّذِيۡنَ يَذۡكُرُوۡنَ اللَّهَ قِيَٰمٗا وَّقُعُوۡدٗا وَّعَلَىٰ جُنُوۡبِهِمۡۗ وَيَتَفَكَّرُوۡنَ فِيۡ خَلۡقِ السَّمَٰوَٰتِ وَالۡأَرۡضِۗ رَبَّنَا مَا خَلَقۡتَ هَٰذَا بَٰطِلٗاۗ سُبۡحَٰنَكَ فَقِنَا عَذَابَ النَّارِ(191) رَبَّنَآ إِنَّكَ مَنۡ تُدۡخِلِ النَّارَ فَقَدۡ أَخۡزَيۡتَهُۥۖ وَمَا لِلظّٰلِمِيۡنَ مِنۡ أَنۡصَارٖ(192) رَّبَّنَآ إِنَّنَا سَمِعۡنَا مُنَادِيٗا يُّنَادِي لِلۡإِيمَٰنِ أَنۡ ءَامِنُوۡاْ بِرَبِّكُمۡ ف‍َٔاٰمَنَّاۚ رَبَّنَا فَاغۡفِرۡ لَنَا ذُنُوۡبَنَا وَكَفِّرۡ عَنَّا سَيِّـَٔاتِنَا وَتَوَفَّنَا مَعَ الۡأَبۡرَارِ. (193) رَبَّنَا وَءَاتِنَا مَا وَعَدۡتَّنَا عَلَىٰ رُسُلِكَۗ وَلَا تُخۡزِنَا يَوۡمَ الۡقِيَٰمَةِۗ إِنَّكَ لَا تُخۡلِفُ الۡمِيۡعَادَ",
    "terjemahan": "Sesungguhnya di dalam penciptaan langit dan bumi, dan silih bergantinya malam dan siang pasti terdapat tanda-tanda bagi orang-orang yang berakal (190), (yaitu) orang-orang yang mengingat Allah sambil berdiri atau duduk atau dalam keadaan berbaring dan mereka memikirkan tentang penciptaan langit dan bumi (seraya berkata): 'wahai Tuhan kami,  Engkau tidak menciptakan ini dengan sia-sia Maha Suci Engkau, maka peliharalah kami dari siksa neraka (191). Wahai  Tuhan kami, sesungguhnya Engkau, barang siapa yang Engkau masukkan ke dalam neraka, maka sungguh Engkau telah menghinakannya, dan tidak ada bagi orang-orang yang dzolim itu seorang penolongpun (192). Wahai Tuhan kami, sesungguhnya kami mendengar (seruan) orang yang menyeru kepada iman (yaitu): 'hendaklah kalian beriman kepada Tuhan kalian', lalu kami  beriman. Ya Tuhan kami ampunilah bagi kami dosa-dosa kami dan hapuskanlah dari kami kesalahan-kesalahan kami, dan wafatkanlah kami bersama orang-orang yang berbakti (193). Wahai Tuhan kami, berikanlah kepada kami apa apa yang telah Engkau janjikan kepada kami dengan perantaraan rasul-rasul Engkau. Dan janganlah Engkau hinakan kami pada hari kiamat.' Sesungguhnya Engkau tidak menyalahi janji. (Qs. Ali Imran 190-194)"
}, {
    "id": "1.13",
    "arab": "لَا إِلٰهَ اِلَّا أَنۡتَ سُبۡحَانَكَ اللّٰهُمَّ أَسۡتَغۡفِرُكَ لِذَنۡبِيۡ وَأَسۡأَلُكَ رَحۡمَتَكَ اَللّٰهُمَّ زِدۡنِيۡ عِلۡمًا وَلَا تُزِغۡ قَلۡبِيۡ بَعۡدَ إِذۡ هَدَيۡتَنِيۡ وَهَبۡ لِيۡ مِنۡ لَدُنۡكَ رَحۡمَةً إِنَّكَ أَنۡتَ الۡوَهَّابُ ",
    "terjemahan": "Tiada Tuhan melainkan Engkau, Maha Suci Engkau, Aku mohon ampun dari dosaku dan aku mohon kepada-Mu rahmat-Mu. Ya Allah, tambahlah ilmuku dan janganlah Engkau membelokkan hatiku setelah Engkau beri hidayah dan berikanlah kepadaku dari sisi-Mu rahmat sesungguhnya Engkau Maha Pemberi. (HR. Abu Dawud)"
}, {
    "id": "1.14",
    "arab": "Apabila bangun pada malam hari untuk melakukan sholat tahajjud beliau membaca doa ini:\n\nاَللّٰهُمَّ لَكَ الۡحَمۡدُ، اَنۡتَ نُوۡرُ السَّمٰوَاتِ وَالۡاَرۡضِ وَمَنۡ فِيۡهِنَّ، وَلَكَ الۡحَمۡدُ أَنۡتَ قَيِّمُ السَّمٰوَاتِ وَالۡاَرۡضِ وَمَنۡ فِيۡهِنَّ وَلَكَ الۡحَمۡدُ أَنۡتَ الۡحَقُّ وَوَعۡدُكَ الۡحَقُّ وَلِقَاءُكَ حَقٌّ وَقَوۡلُكَ حَقٌّ وَالۡجَنَّةُ حَقٌّ وَالنَّارُ حَقٌّ وَالنَّبِيُّوۡنَ حَقٌّ وَمُحَمَّدٌ صَلَّى اللّٰهُ عَلَيۡهِ وَسَلَّمَ حَقٌّ وَالسَّاعَةُ حَقٌّ، اَللّٰهُمَّ لَكَ أَسۡلَمۡتُ وَبِكَ ءَامَنۡتُ وَعَلَيۡكَ تَوَكَّلۡتُ وَإِلَيۡكَ أَنَبۡتُ وَبِكَ خَاصَمۡتُ وَإِلَيۡكَ حَاكَمۡتُ فَاغۡفِرۡ لِي مَاقَدَّمۡتُ وَمَا أَخَّرۡتُ وَمَا أَسۡرَرۡتُ وَمَا أَعۡلَنۡتُ أَنۡتَ اللّٰهُ لَا إِلٰهَ اِلَّا اَنۡتَ ",
    "terjemahan": "Ya Allah, bagi-Mu segala puji, Engkaulah cahaya langit dan bumi dan apa-apa yang berada di antaranya. Dan Engkaulah pengatur langit dan bumi dan apa-apa yang ada di antaranya, dan bagimu segala puji, Engkau adalah kebenaran, janji-Mu adalah benar, pertemuan dengan-Mu adalah benar, perkataan-Mu adalah kebenaran, surga itu adalah benar, neraka adalah benar dan para nabi adalah benar, Nabi Muhammad SAW adalah benar, hari kiamat adalah benar, ya Allah, kepada-Mu aku berserah diri dan kepada-Mu aku beriman, dan kepada-Mu aku bertawakkal, dan kepada-Mu aku kembali dan hanya kepada-Mu aku mengadu dan hanya kepada-Mu aku berhakim, maka ampunilah dosaku yang telah lalu maupun yang akan datang, baik apa-apa yang aku rahasiakan dan apa-apa yang aku tampakkan, Engkaulah Allah, tiada ilah kecuali Engkau. (HR. Bukhari Muslim)"
}, {
    "id": "1.15",
    "arab": "Bacaan sholat lail: \n\nاَللّٰهُمَّ اجۡعَلۡ فيۡ قَلۡبِيۡ نُوۡرًا وَفِيۡ سَمۡعِيۡ نُوۡرًا وَ فِيۡ بَصَرِيۡ نُوۡرًا وَعَنۡ يَّمِيۡنِيۡ نُوۡرًا وَّعَنۡ شِمَالِيۡ نُوۡرًا وَعَنۡ أَمَامِيۡ نُوۡرًا وَمِنۡ خَلۡفِيۡ نُوۡرًا وَمِنۡ فَوۡقِيۡ نُوۡرًا وَمِنۡ تَحۡتِيۡ نُوۡرًا وَاجۡعَلۡ لِّيۡ نُوۡرًا ",
    "terjemahan": "Wahai Allah, jadikanlah dalam hatiku cahaya, pada pendengaranku cahaya, pada penglihatanku cahaya dan dari sebelah kananku cahaya, dari sebelah kiriku cahaya, dari depanku cahaya, dari belakangku cahaya dan dari atasku cahaya, dari bawahku cahaya dan jadikanlah pada diriku cahaya. (HR. Muslim)"
}
],
"doaZiarahKubur": [
    {
        "id": "1.1",
        "arab": "Do’a Takziyah\nDibaca Di Sisi Orang Meninggal: \n\nاَللّٰهُمَّ اغۡفِرۡلِيۡ وَلَهُ وَأَعۡقِبۡنِيۡ مِنۡهُ عُقۡبَى حَسَنَةً ",
        "terjemahan": "Ya Allah, Ampunilah aku dan orang ini dan berilah aku ganti yang baik dari padanya (HR. Muslim)"
    },   {
        "id": "1.2",
        "arab": "Do’a Ketika Memejamkan Mata Mayat: \n\nاَللّٰهُمَّ اغۡفِرۡ لِ … وَارۡفَعۡ دَرَجَتَهُ فِي الۡمَهۡدِيِّيۡنَ وَاخۡلُفۡهُ فِيۡ عُقۡبِهِ فِي الۡغٰبِرِيۡنَ. وَاغۡفِرۡ لَنَا وَلَهُ يَا رَبَّ الۡعٰلَمِيۡنَ. وَافۡسَحۡ لَهُ فِيۡ قَبۡرِهِ وَنَوِّرۡ لَهُ فِيۡهِ ",
        "terjemahan": "Ya Allah, berilah ampunan kepada ……  (nama mayyit) dan tinggikanlah derajatnya di mahdiyin (tempat tertinggi) dan gantikanlah dia pada keturunannya yang ditinggalkan, ampunilah kami dan dia, wahai Tuhan semesta alam, luaskanlah kuburnya, dan berilah cahaya di dalam kuburnya. (HR. Muslim)"
    },   {
        "id": "1.3",
        "arab": "Do'a Masuk Ke Makam: \n\nاَلسَّلَامُ عَلَيۡكُمۡ  أَهۡلَ الدِّيَارِ مِنَ الۡمُؤۡمِنِيۡنَ وَالۡمُسۡلِمِيۡنَ  وَإِنَّا إِنۡ شَآءَ اللّٰهُ بِكُمۡ لَلَاحِقُوۡنَ (وَيَرۡحَمُ اللّٰهُ الۡمُسۡتَقۡدِمِيۡنَ مِنَّا وَالۡمُسۡتَأۡخِرِيۡنَ ) أَسۡأَلُ اللّٰهَ لَنَاوَلَكُمۡ الۡعَافِيَةَ ",
        "terjemahan": "Semoga keselamatan tercurahkan kepadamu wahai penghuni kubur yang berasal dari orang-orang mukmin dan orang-orang muslim dan sesungguhnya Insya Allah kami akan bergabung bersama kalian (dan semoga Allah merahmati orang-orang yang mendahului kami dan yang akan mengikuti kami) aku mohon kesehatan untuk kami dan kalian. (HR. Muslim)"
    },   {
        "id": "1.4",
        "arab": "Doa Bagi Mayyit\nDoa ini adalah bacaan sholat jenazah pada takbir ke-3: \n\nأَعُوۡذُ  بِاللّٰهِ مِنَ الشَّيۡطَانِ الرَّجِيۡمِ  بِسۡمِ اللّٰهِ الرَّحۡمٰنِ الرَّحِيۡمِاَلۡحَمۡدُ لِلّٰهِ رَبِّ الۡعَالَمِيۡنَ حَمۡدًا يُوَافِيۡ نِعَمَهُ وَيُكَافِيۡ مَزِيۡدَهُ. يَا رَبَّنَا لَكَ الۡحَمۡدُ كَمَا يَنۡبَغِيۡ لِجَلَالِ وَجۡهِكَ وَعَظِيۡمِ سُلۡطَانِكَ (رَوَاهُ ابن مَاجَه) اَللّٰهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى اٰلِ مُحَمَّـدٍ ",
        "terjemahan": "'Segala puji bagi Allah yang telah menyempurnakan nikmat dan karunia-Nya. Wahai Tuhan kami, bagi-Mu segala puji sesuai keagungan wajah-Mu dan kemegahan kerajaan-Mu.' (HR. Ibnu Majah) 'Ya Allah, sampaikanlah shalawat atas Nabi Muhammad dan atas keluarga Nabi Muhammad.' (HR. Ashhabussunan)"
    },   {
        "id": "1.5",
        "arab": "رَبَّنَا اغۡفِرۡ لَنَا وَلِإِخۡوَانِنَا الَّذِيۡنَ سَبَقُوۡنَا بِالۡإِيۡمَانِ وَلَا تَجۡعَلۡ فِيۡ قُلُوۡبِنَا غِلًّا لِلَّذِيۡنَ ءَامَنُوۡا رَبَّنَآ إِنَّكَ رَءُوۡفٌ رَّحِيۡمٌ ",
        "terjemahan": "Ya Tuhan kami, ampunilah kami, dan saudara-saudara kami yang telah mendahului kami dalam iman, dan janganlah Engkau jadikan dalam hati-hati kami kedengkian kepada orang-orang yang beriman, sesungguhnya Engkau Maha Pengasih lagi Maha Penyanyang. (QS. Al Hasyr: 10) "
    },   {
        "id": "1.6",
        "arab": "اَللّٰهُمَّ اغۡفِرۡ لِحَيِّنَا وَمَيِّتِنَا وَشَاهِدِنَا وَغَائِبِنَا وَصَغِيۡرِنَا وَكَبِيۡرِنَا وَذَكَرِنَا وَأُنۡثَانَا. اَللّٰهُمَّ مَنۡ أَحۡيَيۡتَهُ مِنَّا فَأَحۡيِهِ عَلَى الۡإِسۡلَامِ وَمَنۡ تَوَفَّيۡتَهُ مِنَّا فَتَوَفَّهُ عَلَى الۡإِيۡمَانِ. اَللّٰهُمَّ لَا تَحۡرِمۡنَا أَجۡرَهُ وَلَا تُضِلَّنَا بَعۡدَهُ ",
        "terjemahan": "Ya Allah, ampunilah orang yang hidup dan yang mati diantara kami, yang hadir  dan yang tidak hadir, yang kecil dan yang besar, yang  laki-laki dan yang perempuan diantara kami. Ya Allah, orang yang Engkau hidupkan diantara kami maka hidupkanlah dalam agama Islam dan orang yang Engkau wafatkan diantara kami maka wafatkanlah dalam iman. Ya Allah, janganlah Engkau mencegah kami dari ganjarannya dan janganlah Engkau sesatkan kami setelah itu. (HR. Ibnu Majah)"
    },   {
        "id": "1.7",
        "arab": "Doa ini adalah bacaan sholat jenazah pada takbir ke-2: \n\nاَللّٰهُمَّ اغۡفِرۡ لَهُ (لَهَا) وَارۡحَمۡهُ (وَارۡحَمۡهَا) وَعَافِهِ (وَعَافِهَا) وَاعۡفُ عَنۡهُ (عَنۡهَا) وَأَكۡرِمۡ نُزُلَهُ (نُزُلَهَا) وَوَسِّعۡ مَدۡخَلَهُ  (مَدۡخَلَهَا) وَاغۡسِلۡهُ (وَاغۡسِلۡهَا) بِمَآءٍ وَّثَلۡجٍ وَّنَقِّهِ (وَنَقِّهَا) مِنَ الۡخَطَايَ كَمَا يُنَقَّى الثَّوۡبُ الۡاَبۡيَضُ مِنَ الدَّنَسِ وَأَبۡدِلۡهُ (أَبۡدِلۡهَا) دَارًا خَيۡرًا مِنۡ دَارِهِ (دَارِهَا) وَأَهۡلًا خَيۡرً مِّنۡ أَهۡلِهِ (أَهۡلِهَا) وَزَوۡجًا خَيۡرًا مِنۡ زَوۡجِهِ (زَوۡجِهَا) وَقِهِ (وَقِهَا) فِتۡنَةَ الۡقَبۡرِ وَعَذَابَهُ  ",
        "terjemahan": "Ya Allah, ampunilah dosanya dan rahmatilah dia, sehatkanlah dia, dan maafkanlah dia, dan muliakanlah dia dan luaskanlah liang lahatnya dan bersihkanlah dia dengan air, salju dan embun, dan bersihkanlah dia dari kesalahan-kesalahan sebagaimana dibersihkannya pakaian yang putih dari kotoran, dan gantikanlah dia rumah yang lebih baik dari rumahnya, dan keluarga yang lebih baik dari keluarganya dan pasangan yang lebih baik dari pasangannya dan jagalah dia dari fitnah kubur dan adzabnya. (HR. Muslim)"
    },   {
        "id": "1.8",
        "arab": "اَللّٰهُمَّ اغۡفِرۡ لَهُ (لَهَا) وَارۡحَمۡهُ (وَارۡحَمۡهَا) وَعَافِهِ (عَافِهَا) وَاعۡفُ عَنۡهُ (عَنۡهَا) وَاجۡعَلِ الۡجَنَّةَ مَثۡوَاهُ (مَثۡوَاهَا). اَللّٰهُمَّ  أَبۡدِلۡهُ (أَبۡدِلۡهَا) دَارًا خَيۡرًا مِّنۡ دَارِهِ (دَارِهَا) وَزَوۡجًا خَيۡرًا مِّنۡ زَوۡجِهِ (زَوۡجِهَا) وَأَهۡلًا خَيۡرً مِّنۡ أَهۡلِهِ (أَهۡلِهَا). اَللّٰهُمَّ   إِنَّهُ نَزَلَ (إِنَّهَا نَزَلَتۡ) بِكَ وَأَنۡتَ خَيۡرُ مَنۡزُوۡلٍ بِهِ (بِهَا). اَللّٰهُمَّ  أَكۡرِمۡ نُزُلَهُ (نُزُلَهَا) وَوَسِّعۡ مَدۡخَلَهُ (مَدۡخَلَهَا) اَللّٰهُمَّ  لَا تَحۡرِمۡنَا أَجۡرَهُ وَلَا تَفۡتِنَّا بَعۡدَهُ (بَعۡدَهَا) وَاغۡفِرۡ لَنَا وَلَهُ (لَهَا) ",
        "terjemahan": "Ya Allah, ampunilah dia dan rahmatilah dia, dan sehatkanlah dia, dan maafkanlah dia, dan jadikanlah surga sebagai tempat kembalinya. Ya Allah, gantikanlah baginya rumah yang lebih baik dari rumahnya dan pasangan yang lebih baik dari pasangannya dan keluarga yang lebih baik dari keluarganya. Ya Allah, dia kembali karena-Mu dan Engkaulah sebaik-baik tempat kembali  dengannya. Ya Allah, muliakanlah pengembaliannya, dan luaskanlah tempat masuknya (liang lahat), Ya Allah janganlah Engkau haramkan kami imbalannya dan janganlah Engkau beri fitnah setelah kematiannya dan ampunilah dosa-dosa kami dan dosanya."
    },   {
        "id": "1.9",
        "arab": "اَللّٰهُمَّ لَا تَحۡرِمۡنَا أَجۡرَهُ وَلَا تَفۡتِنَّا بَعۡدَهُ وَاغۡفِرۡ لَنَا وَلَهُ ",
        "terjemahan": "Ya Allah, janganlah Engkau halangi kami darinya untuk memperoleh ganjaran dan janganlah Engkau beri kami fitnah sepeninggalnya, dan ampunilah dosa kami dan dosanya."
    },   {
        "id": "1.10",
        "arab": "سُبۡحٰنَ رَبِّكَ رَبِّ الۡعِزَّةِ عَمَّا يَصِفُوۡنَ. وَسَلَامٌ عَلَى الۡمُرۡسَلِيۡنَ. وَالۡحَمۡدُ لِلّٰهِ رَبِّ الۡعٰلَمِيۡنَ ",
        "terjemahan": "Maha Suci Tuhanmu yang Maha Tinggi dari apa-apa yang mereka sifatkan dan keselamatan atas para Rasul, dan segala puji bagi Allah, Tuhan semesta alam. (QS. Ash-Shaffat: 180-182)"
    }
    ]
}